SoCXin/HC32F4A0/src/hc32f4a0sghb_template/common/hc32f4a0sghb.h
#define M4_ADC1                              ((M4_ADC_TypeDef *)0x40040000UL)
#define M4_ADC2                              ((M4_ADC_TypeDef *)0x40040400UL)
#define M4_ADC3                              ((M4_ADC_TypeDef *)0x40040800UL)
#define M4_AES                               ((M4_AES_TypeDef *)0x40008000UL)
#define M4_AOS                               ((M4_AOS_TypeDef *)0x40010800UL)
#define M4_CAN1                              ((M4_CAN_TypeDef *)0x40009000UL)
#define M4_CAN2                              ((M4_CAN_TypeDef *)0x40078000UL)
#define M4_CMP1                              ((M4_CMP_TypeDef *)0x4004A000UL)
#define M4_CMP2                              ((M4_CMP_TypeDef *)0x4004A010UL)
#define M4_CMP3                              ((M4_CMP_TypeDef *)0x4004A400UL)
#define M4_CMP4                              ((M4_CMP_TypeDef *)0x4004A410UL)
#define M4_CMU                               ((M4_CMU_TypeDef *)0x4004C400UL)
#define M4_CRC                               ((M4_CRC_TypeDef *)0x40008C00UL)
#define M4_CTC                               ((M4_CTC_TypeDef *)0x40049C00UL)
#define M4_DAC1                              ((M4_DAC_TypeDef *)0x40041000UL)
#define M4_DAC2                              ((M4_DAC_TypeDef *)0x40041400UL)
#define M4_DBGC                              ((M4_DBGC_TypeDef *)0xE0042000UL)
#define M4_DCU1                              ((M4_DCU_TypeDef *)0x40056000UL)
#define M4_DCU2                              ((M4_DCU_TypeDef *)0x40056400UL)
#define M4_DCU3                              ((M4_DCU_TypeDef *)0x40056800UL)
#define M4_DCU4                              ((M4_DCU_TypeDef *)0x40056C00UL)
#define M4_DCU5                              ((M4_DCU_TypeDef *)0x40057000UL)
#define M4_DCU6                              ((M4_DCU_TypeDef *)0x40057400UL)
#define M4_DCU7                              ((M4_DCU_TypeDef *)0x40057800UL)
#define M4_DCU8                              ((M4_DCU_TypeDef *)0x40057C00UL)
#define M4_DMA1                              ((M4_DMA_TypeDef *)0x40053000UL)
#define M4_DMA2                              ((M4_DMA_TypeDef *)0x40053400UL)
#define M4_DMC                               ((M4_DMC_TypeDef *)0x88000400UL)
#define M4_DVP                               ((M4_DVP_TypeDef *)0x40055800UL)
#define M4_EFM                               ((M4_EFM_TypeDef *)0x40010400UL)
#define M4_EMB0                              ((M4_EMB_TypeDef *)0x40017C00UL)
#define M4_EMB1                              ((M4_EMB_TypeDef *)0x40017C20UL)
#define M4_EMB2                              ((M4_EMB_TypeDef *)0x40017C40UL)
#define M4_EMB3                              ((M4_EMB_TypeDef *)0x40017C60UL)
#define M4_EMB4                              ((M4_EMB_TypeDef *)0x40017C80UL)
#define M4_EMB5                              ((M4_EMB_TypeDef *)0x40017CA0UL)
#define M4_EMB6                              ((M4_EMB_TypeDef *)0x40017CC0UL)
#define M4_ETH                               ((M4_ETH_TypeDef *)0x40050000UL)
#define M4_FCM                               ((M4_FCM_TypeDef *)0x40048400UL)
#define M4_FMAC1                             ((M4_FMAC_TypeDef *)0x40058000UL)
#define M4_FMAC2                             ((M4_FMAC_TypeDef *)0x40058400UL)
#define M4_FMAC3                             ((M4_FMAC_TypeDef *)0x40058800UL)
#define M4_FMAC4                             ((M4_FMAC_TypeDef *)0x40058C00UL)
#define M4_GPIO                              ((M4_GPIO_TypeDef *)0x40053800UL)
#define M4_HASH                              ((M4_HASH_TypeDef *)0x40008400UL)
#define M4_HRPWM                             ((M4_HRPWM_TypeDef *)0x4003C000UL)
#define M4_I2C1                              ((M4_I2C_TypeDef *)0x4004E000UL)
#define M4_I2C2                              ((M4_I2C_TypeDef *)0x4004E400UL)
#define M4_I2C3                              ((M4_I2C_TypeDef *)0x4004E800UL)
#define M4_I2C4                              ((M4_I2C_TypeDef *)0x4004EC00UL)
#define M4_I2C5                              ((M4_I2C_TypeDef *)0x4004F000UL)
#define M4_I2C6                              ((M4_I2C_TypeDef *)0x4004F800UL)
#define M4_I2S1                              ((M4_I2S_TypeDef *)0x4001E000UL)
#define M4_I2S2                              ((M4_I2S_TypeDef *)0x4001E400UL)
#define M4_I2S3                              ((M4_I2S_TypeDef *)0x40022000UL)
#define M4_I2S4                              ((M4_I2S_TypeDef *)0x40022400UL)
#define M4_ICG                               ((M4_ICG_TypeDef *)0x00000400UL)
#define M4_INTC                              ((M4_INTC_TypeDef *)0x40051000UL)
#define M4_KEYSCAN                           ((M4_KEYSCAN_TypeDef *)0x40050C00UL)
#define M4_MAU                               ((M4_MAU_TypeDef *)0x40055000UL)
#define M4_MPU                               ((M4_MPU_TypeDef *)0x40050000UL)
#define M4_NFC                               ((M4_NFC_TypeDef *)0x88100000UL)
#define M4_OTS                               ((M4_OTS_TypeDef *)0x40010600UL)
#define M4_PERIC                             ((M4_PERIC_TypeDef *)0x40055400UL)
#define M4_PWC                               ((M4_PWC_TypeDef *)0x40048000UL)
#define M4_QSPI                              ((M4_QSPI_TypeDef *)0x9C000000UL)
#define M4_RMU                               ((M4_RMU_TypeDef *)0x4004CC00UL)
#define M4_RTC                               ((M4_RTC_TypeDef *)0x4004C000UL)
#define M4_SDIOC1                            ((M4_SDIOC_TypeDef *)0x40070000UL)
#define M4_SDIOC2                            ((M4_SDIOC_TypeDef *)0x40078400UL)
#define M4_SMC                               ((M4_SMC_TypeDef *)0x88000000UL)
#define M4_SPI1                              ((M4_SPI_TypeDef *)0x4001C000UL)
#define M4_SPI2                              ((M4_SPI_TypeDef *)0x4001C400UL)
#define M4_SPI3                              ((M4_SPI_TypeDef *)0x4001C800UL)
#define M4_SPI4                              ((M4_SPI_TypeDef *)0x40020000UL)
#define M4_SPI5                              ((M4_SPI_TypeDef *)0x40020400UL)
#define M4_SPI6                              ((M4_SPI_TypeDef *)0x40020800UL)
#define M4_SRAMC                             ((M4_SRAMC_TypeDef *)0x40050800UL)
#define M4_SWDT                              ((M4_SWDT_TypeDef *)0x40049400UL)
#define M4_TMR0_1                            ((M4_TMR0_TypeDef *)0x40024000UL)
#define M4_TMR0_2                            ((M4_TMR0_TypeDef *)0x40024400UL)
#define M4_TMR2_1                            ((M4_TMR2_TypeDef *)0x40024800UL)
#define M4_TMR2_2                            ((M4_TMR2_TypeDef *)0x40024C00UL)
#define M4_TMR2_3                            ((M4_TMR2_TypeDef *)0x40025000UL)
#define M4_TMR2_4                            ((M4_TMR2_TypeDef *)0x40025400UL)
#define M4_TMR4_1                            ((M4_TMR4_TypeDef *)0x40038000UL)
#define M4_TMR4_2                            ((M4_TMR4_TypeDef *)0x40038400UL)
#define M4_TMR4_3                            ((M4_TMR4_TypeDef *)0x40038800UL)
#define M4_TMR6_1                            ((M4_TMR6_TypeDef *)0x40018000UL)
#define M4_TMR6_2                            ((M4_TMR6_TypeDef *)0x40018400UL)
#define M4_TMR6_3                            ((M4_TMR6_TypeDef *)0x40018800UL)
#define M4_TMR6_4                            ((M4_TMR6_TypeDef *)0x40018C00UL)
#define M4_TMR6_5                            ((M4_TMR6_TypeDef *)0x40019000UL)
#define M4_TMR6_6                            ((M4_TMR6_TypeDef *)0x40019400UL)
#define M4_TMR6_7                            ((M4_TMR6_TypeDef *)0x40019800UL)
#define M4_TMR6_8                            ((M4_TMR6_TypeDef *)0x40019C00UL)
#define M4_TMRA_1                            ((M4_TMRA_TypeDef *)0x4003A000UL)
#define M4_TMRA_10                           ((M4_TMRA_TypeDef *)0x40027400UL)
#define M4_TMRA_11                           ((M4_TMRA_TypeDef *)0x40027800UL)
#define M4_TMRA_12                           ((M4_TMRA_TypeDef *)0x40027C00UL)
#define M4_TMRA_2                            ((M4_TMRA_TypeDef *)0x4003A400UL)
#define M4_TMRA_3                            ((M4_TMRA_TypeDef *)0x4003A800UL)
#define M4_TMRA_4                            ((M4_TMRA_TypeDef *)0x4003AC00UL)
#define M4_TMRA_5                            ((M4_TMRA_TypeDef *)0x40026000UL)
#define M4_TMRA_6                            ((M4_TMRA_TypeDef *)0x40026400UL)
#define M4_TMRA_7                            ((M4_TMRA_TypeDef *)0x40026800UL)
#define M4_TMRA_8                            ((M4_TMRA_TypeDef *)0x40026C00UL)
#define M4_TMRA_9                            ((M4_TMRA_TypeDef *)0x40027000UL)
#define M4_TRNG                              ((M4_TRNG_TypeDef *)0x40042000UL)
#define M4_USART1                            ((M4_USART_TypeDef *)0x4001CC00UL)
#define M4_USART10                           ((M4_USART_TypeDef *)0x40021C00UL)
#define M4_USART2                            ((M4_USART_TypeDef *)0x4001D000UL)
#define M4_USART3                            ((M4_USART_TypeDef *)0x4001D400UL)
#define M4_USART4                            ((M4_USART_TypeDef *)0x4001D800UL)
#define M4_USART5                            ((M4_USART_TypeDef *)0x4001DC00UL)
#define M4_USART6                            ((M4_USART_TypeDef *)0x40020C00UL)
#define M4_USART7                            ((M4_USART_TypeDef *)0x40021000UL)
#define M4_USART8                            ((M4_USART_TypeDef *)0x40021400UL)
#define M4_USART9                            ((M4_USART_TypeDef *)0x40021800UL)
#define M4_USBFS                             ((M4_USBFS_TypeDef *)0x40080000UL)
#define M4_USBHS                             ((M4_USBHS_TypeDef *)0x400C0000UL)
#define M4_WDT                               ((M4_WDT_TypeDef *)0x40049000UL)


/******************************************************************************/
/*                   Peripheral Registers Bits Definition                     */
/******************************************************************************/

