SoCXin/HC32F4A0/src/hc32f4a0sghb_template/common/hc32f4a0sghb.h
/*  Bit definition for GPIO_POSRD register  */
#define GPIO_POSRD_POS00_POS                           (0U)
#define GPIO_POSRD_POS00                               (0x0001U)
#define GPIO_POSRD_POS01_POS                           (1U)
#define GPIO_POSRD_POS01                               (0x0002U)
#define GPIO_POSRD_POS02_POS                           (2U)
#define GPIO_POSRD_POS02                               (0x0004U)
#define GPIO_POSRD_POS03_POS                           (3U)
#define GPIO_POSRD_POS03                               (0x0008U)
#define GPIO_POSRD_POS04_POS                           (4U)
#define GPIO_POSRD_POS04                               (0x0010U)
#define GPIO_POSRD_POS05_POS                           (5U)
#define GPIO_POSRD_POS05                               (0x0020U)
#define GPIO_POSRD_POS06_POS                           (6U)
#define GPIO_POSRD_POS06                               (0x0040U)
#define GPIO_POSRD_POS07_POS                           (7U)
#define GPIO_POSRD_POS07                               (0x0080U)
#define GPIO_POSRD_POS08_POS                           (8U)
#define GPIO_POSRD_POS08                               (0x0100U)
#define GPIO_POSRD_POS09_POS                           (9U)
#define GPIO_POSRD_POS09                               (0x0200U)
#define GPIO_POSRD_POS10_POS                           (10U)
#define GPIO_POSRD_POS10                               (0x0400U)
#define GPIO_POSRD_POS11_POS                           (11U)
#define GPIO_POSRD_POS11                               (0x0800U)
#define GPIO_POSRD_POS12_POS                           (12U)
#define GPIO_POSRD_POS12                               (0x1000U)
#define GPIO_POSRD_POS13_POS                           (13U)
#define GPIO_POSRD_POS13                               (0x2000U)
#define GPIO_POSRD_POS14_POS                           (14U)
#define GPIO_POSRD_POS14                               (0x4000U)
#define GPIO_POSRD_POS15_POS                           (15U)
#define GPIO_POSRD_POS15                               (0x8000U)

/*  Bit definition for GPIO_PORRD register  */
#define GPIO_PORRD_POR00_POS                           (0U)
#define GPIO_PORRD_POR00                               (0x0001U)
#define GPIO_PORRD_POR01_POS                           (1U)
#define GPIO_PORRD_POR01                               (0x0002U)
#define GPIO_PORRD_POR02_POS                           (2U)
#define GPIO_PORRD_POR02                               (0x0004U)
#define GPIO_PORRD_POR03_POS                           (3U)
#define GPIO_PORRD_POR03                               (0x0008U)
#define GPIO_PORRD_POR04_POS                           (4U)
#define GPIO_PORRD_POR04                               (0x0010U)
#define GPIO_PORRD_POR05_POS                           (5U)
#define GPIO_PORRD_POR05                               (0x0020U)
#define GPIO_PORRD_POR06_POS                           (6U)
#define GPIO_PORRD_POR06                               (0x0040U)
#define GPIO_PORRD_POR07_POS                           (7U)
#define GPIO_PORRD_POR07                               (0x0080U)
#define GPIO_PORRD_POR08_POS                           (8U)
#define GPIO_PORRD_POR08                               (0x0100U)
#define GPIO_PORRD_POR09_POS                           (9U)
#define GPIO_PORRD_POR09                               (0x0200U)
#define GPIO_PORRD_POR10_POS                           (10U)
#define GPIO_PORRD_POR10                               (0x0400U)
#define GPIO_PORRD_POR11_POS                           (11U)
#define GPIO_PORRD_POR11                               (0x0800U)
#define GPIO_PORRD_POR12_POS                           (12U)
#define GPIO_PORRD_POR12                               (0x1000U)
#define GPIO_PORRD_POR13_POS                           (13U)
#define GPIO_PORRD_POR13                               (0x2000U)
#define GPIO_PORRD_POR14_POS                           (14U)
#define GPIO_PORRD_POR14                               (0x4000U)
#define GPIO_PORRD_POR15_POS                           (15U)
#define GPIO_PORRD_POR15                               (0x8000U)

/*  Bit definition for GPIO_POTRD register  */
#define GPIO_POTRD_POT00_POS                           (0U)
#define GPIO_POTRD_POT00                               (0x0001U)
#define GPIO_POTRD_POT01_POS                           (1U)
#define GPIO_POTRD_POT01                               (0x0002U)
#define GPIO_POTRD_POT02_POS                           (2U)
#define GPIO_POTRD_POT02                               (0x0004U)
#define GPIO_POTRD_POT03_POS                           (3U)
#define GPIO_POTRD_POT03                               (0x0008U)
#define GPIO_POTRD_POT04_POS                           (4U)
#define GPIO_POTRD_POT04                               (0x0010U)
#define GPIO_POTRD_POT05_POS                           (5U)
#define GPIO_POTRD_POT05                               (0x0020U)
#define GPIO_POTRD_POT06_POS                           (6U)
#define GPIO_POTRD_POT06                               (0x0040U)
#define GPIO_POTRD_POT07_POS                           (7U)
#define GPIO_POTRD_POT07                               (0x0080U)
#define GPIO_POTRD_POT08_POS                           (8U)
#define GPIO_POTRD_POT08                               (0x0100U)
#define GPIO_POTRD_POT09_POS                           (9U)
#define GPIO_POTRD_POT09                               (0x0200U)
#define GPIO_POTRD_POT10_POS                           (10U)
#define GPIO_POTRD_POT10                               (0x0400U)
#define GPIO_POTRD_POT11_POS                           (11U)
#define GPIO_POTRD_POT11                               (0x0800U)
#define GPIO_POTRD_POT12_POS                           (12U)
#define GPIO_POTRD_POT12                               (0x1000U)
#define GPIO_POTRD_POT13_POS                           (13U)
#define GPIO_POTRD_POT13                               (0x2000U)
#define GPIO_POTRD_POT14_POS                           (14U)
#define GPIO_POTRD_POT14                               (0x4000U)
#define GPIO_POTRD_POT15_POS                           (15U)
#define GPIO_POTRD_POT15                               (0x8000U)

/*  Bit definition for GPIO_PIDRE register  */
#define GPIO_PIDRE_PIN00_POS                           (0U)
#define GPIO_PIDRE_PIN00                               (0x0001U)
#define GPIO_PIDRE_PIN01_POS                           (1U)
#define GPIO_PIDRE_PIN01                               (0x0002U)
#define GPIO_PIDRE_PIN02_POS                           (2U)
#define GPIO_PIDRE_PIN02                               (0x0004U)
#define GPIO_PIDRE_PIN03_POS                           (3U)
#define GPIO_PIDRE_PIN03                               (0x0008U)
#define GPIO_PIDRE_PIN04_POS                           (4U)
#define GPIO_PIDRE_PIN04                               (0x0010U)
#define GPIO_PIDRE_PIN05_POS                           (5U)
#define GPIO_PIDRE_PIN05                               (0x0020U)
#define GPIO_PIDRE_PIN06_POS                           (6U)
#define GPIO_PIDRE_PIN06                               (0x0040U)
#define GPIO_PIDRE_PIN07_POS                           (7U)
#define GPIO_PIDRE_PIN07                               (0x0080U)
#define GPIO_PIDRE_PIN08_POS                           (8U)
#define GPIO_PIDRE_PIN08                               (0x0100U)
#define GPIO_PIDRE_PIN09_POS                           (9U)
#define GPIO_PIDRE_PIN09                               (0x0200U)
#define GPIO_PIDRE_PIN10_POS                           (10U)
#define GPIO_PIDRE_PIN10                               (0x0400U)
#define GPIO_PIDRE_PIN11_POS                           (11U)
#define GPIO_PIDRE_PIN11                               (0x0800U)
#define GPIO_PIDRE_PIN12_POS                           (12U)
#define GPIO_PIDRE_PIN12                               (0x1000U)
#define GPIO_PIDRE_PIN13_POS                           (13U)
#define GPIO_PIDRE_PIN13                               (0x2000U)
#define GPIO_PIDRE_PIN14_POS                           (14U)
#define GPIO_PIDRE_PIN14                               (0x4000U)
#define GPIO_PIDRE_PIN15_POS                           (15U)
#define GPIO_PIDRE_PIN15                               (0x8000U)

/*  Bit definition for GPIO_PODRE register  */
#define GPIO_PODRE_POUT00_POS                          (0U)
#define GPIO_PODRE_POUT00                              (0x0001U)
#define GPIO_PODRE_POUT01_POS                          (1U)
#define GPIO_PODRE_POUT01                              (0x0002U)
#define GPIO_PODRE_POUT02_POS                          (2U)
#define GPIO_PODRE_POUT02                              (0x0004U)
#define GPIO_PODRE_POUT03_POS                          (3U)
#define GPIO_PODRE_POUT03                              (0x0008U)
#define GPIO_PODRE_POUT04_POS                          (4U)
#define GPIO_PODRE_POUT04                              (0x0010U)
#define GPIO_PODRE_POUT05_POS                          (5U)
#define GPIO_PODRE_POUT05                              (0x0020U)
#define GPIO_PODRE_POUT06_POS                          (6U)
#define GPIO_PODRE_POUT06                              (0x0040U)
#define GPIO_PODRE_POUT07_POS                          (7U)
#define GPIO_PODRE_POUT07                              (0x0080U)
#define GPIO_PODRE_POUT08_POS                          (8U)
#define GPIO_PODRE_POUT08                              (0x0100U)
#define GPIO_PODRE_POUT09_POS                          (9U)
#define GPIO_PODRE_POUT09                              (0x0200U)
#define GPIO_PODRE_POUT10_POS                          (10U)
#define GPIO_PODRE_POUT10                              (0x0400U)
#define GPIO_PODRE_POUT11_POS                          (11U)
#define GPIO_PODRE_POUT11                              (0x0800U)
#define GPIO_PODRE_POUT12_POS                          (12U)
#define GPIO_PODRE_POUT12                              (0x1000U)
#define GPIO_PODRE_POUT13_POS                          (13U)
#define GPIO_PODRE_POUT13                              (0x2000U)
#define GPIO_PODRE_POUT14_POS                          (14U)
#define GPIO_PODRE_POUT14                              (0x4000U)
#define GPIO_PODRE_POUT15_POS                          (15U)
#define GPIO_PODRE_POUT15                              (0x8000U)

