SoCXin/HC32F4A0/src/hc32f4a0sghb_template/common/hc32f4a0sghb.h
/*  Bit definition for GPIO_PODRG register  */
#define GPIO_PODRG_POUT00_POS                          (0U)
#define GPIO_PODRG_POUT00                              (0x0001U)
#define GPIO_PODRG_POUT01_POS                          (1U)
#define GPIO_PODRG_POUT01                              (0x0002U)
#define GPIO_PODRG_POUT02_POS                          (2U)
#define GPIO_PODRG_POUT02                              (0x0004U)
#define GPIO_PODRG_POUT03_POS                          (3U)
#define GPIO_PODRG_POUT03                              (0x0008U)
#define GPIO_PODRG_POUT04_POS                          (4U)
#define GPIO_PODRG_POUT04                              (0x0010U)
#define GPIO_PODRG_POUT05_POS                          (5U)
#define GPIO_PODRG_POUT05                              (0x0020U)
#define GPIO_PODRG_POUT06_POS                          (6U)
#define GPIO_PODRG_POUT06                              (0x0040U)
#define GPIO_PODRG_POUT07_POS                          (7U)
#define GPIO_PODRG_POUT07                              (0x0080U)
#define GPIO_PODRG_POUT08_POS                          (8U)
#define GPIO_PODRG_POUT08                              (0x0100U)
#define GPIO_PODRG_POUT09_POS                          (9U)
#define GPIO_PODRG_POUT09                              (0x0200U)
#define GPIO_PODRG_POUT10_POS                          (10U)
#define GPIO_PODRG_POUT10                              (0x0400U)
#define GPIO_PODRG_POUT11_POS                          (11U)
#define GPIO_PODRG_POUT11                              (0x0800U)
#define GPIO_PODRG_POUT12_POS                          (12U)
#define GPIO_PODRG_POUT12                              (0x1000U)
#define GPIO_PODRG_POUT13_POS                          (13U)
#define GPIO_PODRG_POUT13                              (0x2000U)
#define GPIO_PODRG_POUT14_POS                          (14U)
#define GPIO_PODRG_POUT14                              (0x4000U)
#define GPIO_PODRG_POUT15_POS                          (15U)
#define GPIO_PODRG_POUT15                              (0x8000U)

/*  Bit definition for GPIO_POERG register  */
#define GPIO_POERG_POUTE00_POS                         (0U)
#define GPIO_POERG_POUTE00                             (0x0001U)
#define GPIO_POERG_POUTE01_POS                         (1U)
#define GPIO_POERG_POUTE01                             (0x0002U)
#define GPIO_POERG_POUTE02_POS                         (2U)
#define GPIO_POERG_POUTE02                             (0x0004U)
#define GPIO_POERG_POUTE03_POS                         (3U)
#define GPIO_POERG_POUTE03                             (0x0008U)
#define GPIO_POERG_POUTE04_POS                         (4U)
#define GPIO_POERG_POUTE04                             (0x0010U)
#define GPIO_POERG_POUTE05_POS                         (5U)
#define GPIO_POERG_POUTE05                             (0x0020U)
#define GPIO_POERG_POUTE06_POS                         (6U)
#define GPIO_POERG_POUTE06                             (0x0040U)
#define GPIO_POERG_POUTE07_POS                         (7U)
#define GPIO_POERG_POUTE07                             (0x0080U)
#define GPIO_POERG_POUTE08_POS                         (8U)
#define GPIO_POERG_POUTE08                             (0x0100U)
#define GPIO_POERG_POUTE09_POS                         (9U)
#define GPIO_POERG_POUTE09                             (0x0200U)
#define GPIO_POERG_POUTE10_POS                         (10U)
#define GPIO_POERG_POUTE10                             (0x0400U)
#define GPIO_POERG_POUTE11_POS                         (11U)
#define GPIO_POERG_POUTE11                             (0x0800U)
#define GPIO_POERG_POUTE12_POS                         (12U)
#define GPIO_POERG_POUTE12                             (0x1000U)
#define GPIO_POERG_POUTE13_POS                         (13U)
#define GPIO_POERG_POUTE13                             (0x2000U)
#define GPIO_POERG_POUTE14_POS                         (14U)
#define GPIO_POERG_POUTE14                             (0x4000U)
#define GPIO_POERG_POUTE15_POS                         (15U)
#define GPIO_POERG_POUTE15                             (0x8000U)

/*  Bit definition for GPIO_POSRG register  */
#define GPIO_POSRG_POS00_POS                           (0U)
#define GPIO_POSRG_POS00                               (0x0001U)
#define GPIO_POSRG_POS01_POS                           (1U)
#define GPIO_POSRG_POS01                               (0x0002U)
#define GPIO_POSRG_POS02_POS                           (2U)
#define GPIO_POSRG_POS02                               (0x0004U)
#define GPIO_POSRG_POS03_POS                           (3U)
#define GPIO_POSRG_POS03                               (0x0008U)
#define GPIO_POSRG_POS04_POS                           (4U)
#define GPIO_POSRG_POS04                               (0x0010U)
#define GPIO_POSRG_POS05_POS                           (5U)
#define GPIO_POSRG_POS05                               (0x0020U)
#define GPIO_POSRG_POS06_POS                           (6U)
#define GPIO_POSRG_POS06                               (0x0040U)
#define GPIO_POSRG_POS07_POS                           (7U)
#define GPIO_POSRG_POS07                               (0x0080U)
#define GPIO_POSRG_POS08_POS                           (8U)
#define GPIO_POSRG_POS08                               (0x0100U)
#define GPIO_POSRG_POS09_POS                           (9U)
#define GPIO_POSRG_POS09                               (0x0200U)
#define GPIO_POSRG_POS10_POS                           (10U)
#define GPIO_POSRG_POS10                               (0x0400U)
#define GPIO_POSRG_POS11_POS                           (11U)
#define GPIO_POSRG_POS11                               (0x0800U)
#define GPIO_POSRG_POS12_POS                           (12U)
#define GPIO_POSRG_POS12                               (0x1000U)
#define GPIO_POSRG_POS13_POS                           (13U)
#define GPIO_POSRG_POS13                               (0x2000U)
#define GPIO_POSRG_POS14_POS                           (14U)
#define GPIO_POSRG_POS14                               (0x4000U)
#define GPIO_POSRG_POS15_POS                           (15U)
#define GPIO_POSRG_POS15                               (0x8000U)

/*  Bit definition for GPIO_PORRG register  */
#define GPIO_PORRG_POR00_POS                           (0U)
#define GPIO_PORRG_POR00                               (0x0001U)
#define GPIO_PORRG_POR01_POS                           (1U)
#define GPIO_PORRG_POR01                               (0x0002U)
#define GPIO_PORRG_POR02_POS                           (2U)
#define GPIO_PORRG_POR02                               (0x0004U)
#define GPIO_PORRG_POR03_POS                           (3U)
#define GPIO_PORRG_POR03                               (0x0008U)
#define GPIO_PORRG_POR04_POS                           (4U)
#define GPIO_PORRG_POR04                               (0x0010U)
#define GPIO_PORRG_POR05_POS                           (5U)
#define GPIO_PORRG_POR05                               (0x0020U)
#define GPIO_PORRG_POR06_POS                           (6U)
#define GPIO_PORRG_POR06                               (0x0040U)
#define GPIO_PORRG_POR07_POS                           (7U)
#define GPIO_PORRG_POR07                               (0x0080U)
#define GPIO_PORRG_POR08_POS                           (8U)
#define GPIO_PORRG_POR08                               (0x0100U)
#define GPIO_PORRG_POR09_POS                           (9U)
#define GPIO_PORRG_POR09                               (0x0200U)
#define GPIO_PORRG_POR10_POS                           (10U)
#define GPIO_PORRG_POR10                               (0x0400U)
#define GPIO_PORRG_POR11_POS                           (11U)
#define GPIO_PORRG_POR11                               (0x0800U)
#define GPIO_PORRG_POR12_POS                           (12U)
#define GPIO_PORRG_POR12                               (0x1000U)
#define GPIO_PORRG_POR13_POS                           (13U)
#define GPIO_PORRG_POR13                               (0x2000U)
#define GPIO_PORRG_POR14_POS                           (14U)
#define GPIO_PORRG_POR14                               (0x4000U)
#define GPIO_PORRG_POR15_POS                           (15U)
#define GPIO_PORRG_POR15                               (0x8000U)

/*  Bit definition for GPIO_POTRG register  */
#define GPIO_POTRG_POT00_POS                           (0U)
#define GPIO_POTRG_POT00                               (0x0001U)
#define GPIO_POTRG_POT01_POS                           (1U)
#define GPIO_POTRG_POT01                               (0x0002U)
#define GPIO_POTRG_POT02_POS                           (2U)
#define GPIO_POTRG_POT02                               (0x0004U)
#define GPIO_POTRG_POT03_POS                           (3U)
#define GPIO_POTRG_POT03                               (0x0008U)
#define GPIO_POTRG_POT04_POS                           (4U)
#define GPIO_POTRG_POT04                               (0x0010U)
#define GPIO_POTRG_POT05_POS                           (5U)
#define GPIO_POTRG_POT05                               (0x0020U)
#define GPIO_POTRG_POT06_POS                           (6U)
#define GPIO_POTRG_POT06                               (0x0040U)
#define GPIO_POTRG_POT07_POS                           (7U)
#define GPIO_POTRG_POT07                               (0x0080U)
#define GPIO_POTRG_POT08_POS                           (8U)
#define GPIO_POTRG_POT08                               (0x0100U)
#define GPIO_POTRG_POT09_POS                           (9U)
#define GPIO_POTRG_POT09                               (0x0200U)
#define GPIO_POTRG_POT10_POS                           (10U)
#define GPIO_POTRG_POT10                               (0x0400U)
#define GPIO_POTRG_POT11_POS                           (11U)
#define GPIO_POTRG_POT11                               (0x0800U)
#define GPIO_POTRG_POT12_POS                           (12U)
#define GPIO_POTRG_POT12                               (0x1000U)
#define GPIO_POTRG_POT13_POS                           (13U)
#define GPIO_POTRG_POT13                               (0x2000U)
#define GPIO_POTRG_POT14_POS                           (14U)
#define GPIO_POTRG_POT14                               (0x4000U)
#define GPIO_POTRG_POT15_POS                           (15U)
#define GPIO_POTRG_POT15                               (0x8000U)

/*  Bit definition for GPIO_PIDRH register  */
#define GPIO_PIDRH_PIN00_POS                           (0U)
#define GPIO_PIDRH_PIN00                               (0x0001U)
#define GPIO_PIDRH_PIN01_POS                           (1U)
#define GPIO_PIDRH_PIN01                               (0x0002U)
#define GPIO_PIDRH_PIN02_POS                           (2U)
#define GPIO_PIDRH_PIN02                               (0x0004U)
#define GPIO_PIDRH_PIN03_POS                           (3U)
#define GPIO_PIDRH_PIN03                               (0x0008U)
#define GPIO_PIDRH_PIN04_POS                           (4U)
#define GPIO_PIDRH_PIN04                               (0x0010U)
#define GPIO_PIDRH_PIN05_POS                           (5U)
#define GPIO_PIDRH_PIN05                               (0x0020U)
#define GPIO_PIDRH_PIN06_POS                           (6U)
#define GPIO_PIDRH_PIN06                               (0x0040U)
#define GPIO_PIDRH_PIN07_POS                           (7U)
#define GPIO_PIDRH_PIN07                               (0x0080U)
#define GPIO_PIDRH_PIN08_POS                           (8U)
#define GPIO_PIDRH_PIN08                               (0x0100U)
#define GPIO_PIDRH_PIN09_POS                           (9U)
#define GPIO_PIDRH_PIN09                               (0x0200U)
#define GPIO_PIDRH_PIN10_POS                           (10U)
#define GPIO_PIDRH_PIN10                               (0x0400U)
#define GPIO_PIDRH_PIN11_POS                           (11U)
#define GPIO_PIDRH_PIN11                               (0x0800U)
#define GPIO_PIDRH_PIN12_POS                           (12U)
#define GPIO_PIDRH_PIN12                               (0x1000U)
#define GPIO_PIDRH_PIN13_POS                           (13U)
#define GPIO_PIDRH_PIN13                               (0x2000U)
#define GPIO_PIDRH_PIN14_POS                           (14U)
#define GPIO_PIDRH_PIN14                               (0x4000U)
#define GPIO_PIDRH_PIN15_POS                           (15U)
#define GPIO_PIDRH_PIN15                               (0x8000U)

/*  Bit definition for GPIO_PODRH register  */
#define GPIO_PODRH_POUT00_POS                          (0U)
#define GPIO_PODRH_POUT00                              (0x0001U)
#define GPIO_PODRH_POUT01_POS                          (1U)
#define GPIO_PODRH_POUT01                              (0x0002U)
#define GPIO_PODRH_POUT02_POS                          (2U)
#define GPIO_PODRH_POUT02                              (0x0004U)
#define GPIO_PODRH_POUT03_POS                          (3U)
#define GPIO_PODRH_POUT03                              (0x0008U)
#define GPIO_PODRH_POUT04_POS                          (4U)
#define GPIO_PODRH_POUT04                              (0x0010U)
#define GPIO_PODRH_POUT05_POS                          (5U)
#define GPIO_PODRH_POUT05                              (0x0020U)
#define GPIO_PODRH_POUT06_POS                          (6U)
#define GPIO_PODRH_POUT06                              (0x0040U)
#define GPIO_PODRH_POUT07_POS                          (7U)
#define GPIO_PODRH_POUT07                              (0x0080U)
#define GPIO_PODRH_POUT08_POS                          (8U)
#define GPIO_PODRH_POUT08                              (0x0100U)
#define GPIO_PODRH_POUT09_POS                          (9U)
#define GPIO_PODRH_POUT09                              (0x0200U)
#define GPIO_PODRH_POUT10_POS                          (10U)
#define GPIO_PODRH_POUT10                              (0x0400U)
#define GPIO_PODRH_POUT11_POS                          (11U)
#define GPIO_PODRH_POUT11                              (0x0800U)
#define GPIO_PODRH_POUT12_POS                          (12U)
#define GPIO_PODRH_POUT12                              (0x1000U)
#define GPIO_PODRH_POUT13_POS                          (13U)
#define GPIO_PODRH_POUT13                              (0x2000U)
#define GPIO_PODRH_POUT14_POS                          (14U)
#define GPIO_PODRH_POUT14                              (0x4000U)
#define GPIO_PODRH_POUT15_POS                          (15U)
#define GPIO_PODRH_POUT15                              (0x8000U)

/*  Bit definition for GPIO_POERH register  */
#define GPIO_POERH_POUTE00_POS                         (0U)
#define GPIO_POERH_POUTE00                             (0x0001U)
#define GPIO_POERH_POUTE01_POS                         (1U)
#define GPIO_POERH_POUTE01                             (0x0002U)
#define GPIO_POERH_POUTE02_POS                         (2U)
#define GPIO_POERH_POUTE02                             (0x0004U)
#define GPIO_POERH_POUTE03_POS                         (3U)
#define GPIO_POERH_POUTE03                             (0x0008U)
#define GPIO_POERH_POUTE04_POS                         (4U)
#define GPIO_POERH_POUTE04                             (0x0010U)
#define GPIO_POERH_POUTE05_POS                         (5U)
#define GPIO_POERH_POUTE05                             (0x0020U)
#define GPIO_POERH_POUTE06_POS                         (6U)
#define GPIO_POERH_POUTE06                             (0x0040U)
#define GPIO_POERH_POUTE07_POS                         (7U)
#define GPIO_POERH_POUTE07                             (0x0080U)
#define GPIO_POERH_POUTE08_POS                         (8U)
#define GPIO_POERH_POUTE08                             (0x0100U)
#define GPIO_POERH_POUTE09_POS                         (9U)
#define GPIO_POERH_POUTE09                             (0x0200U)
#define GPIO_POERH_POUTE10_POS                         (10U)
#define GPIO_POERH_POUTE10                             (0x0400U)
#define GPIO_POERH_POUTE11_POS                         (11U)
#define GPIO_POERH_POUTE11                             (0x0800U)
#define GPIO_POERH_POUTE12_POS                         (12U)
#define GPIO_POERH_POUTE12                             (0x1000U)
#define GPIO_POERH_POUTE13_POS                         (13U)
#define GPIO_POERH_POUTE13                             (0x2000U)
#define GPIO_POERH_POUTE14_POS                         (14U)
#define GPIO_POERH_POUTE14                             (0x4000U)
#define GPIO_POERH_POUTE15_POS                         (15U)
#define GPIO_POERH_POUTE15                             (0x8000U)

/*  Bit definition for GPIO_POSRH register  */
#define GPIO_POSRH_POS00_POS                           (0U)
#define GPIO_POSRH_POS00                               (0x0001U)
#define GPIO_POSRH_POS01_POS                           (1U)
#define GPIO_POSRH_POS01                               (0x0002U)
#define GPIO_POSRH_POS02_POS                           (2U)
#define GPIO_POSRH_POS02                               (0x0004U)
#define GPIO_POSRH_POS03_POS                           (3U)
#define GPIO_POSRH_POS03                               (0x0008U)
#define GPIO_POSRH_POS04_POS                           (4U)
#define GPIO_POSRH_POS04                               (0x0010U)
#define GPIO_POSRH_POS05_POS                           (5U)
#define GPIO_POSRH_POS05                               (0x0020U)
#define GPIO_POSRH_POS06_POS                           (6U)
#define GPIO_POSRH_POS06                               (0x0040U)
#define GPIO_POSRH_POS07_POS                           (7U)
#define GPIO_POSRH_POS07                               (0x0080U)
#define GPIO_POSRH_POS08_POS                           (8U)
#define GPIO_POSRH_POS08                               (0x0100U)
#define GPIO_POSRH_POS09_POS                           (9U)
#define GPIO_POSRH_POS09                               (0x0200U)
#define GPIO_POSRH_POS10_POS                           (10U)
#define GPIO_POSRH_POS10                               (0x0400U)
#define GPIO_POSRH_POS11_POS                           (11U)
#define GPIO_POSRH_POS11                               (0x0800U)
#define GPIO_POSRH_POS12_POS                           (12U)
#define GPIO_POSRH_POS12                               (0x1000U)
#define GPIO_POSRH_POS13_POS                           (13U)
#define GPIO_POSRH_POS13                               (0x2000U)
#define GPIO_POSRH_POS14_POS                           (14U)
#define GPIO_POSRH_POS14                               (0x4000U)
#define GPIO_POSRH_POS15_POS                           (15U)
#define GPIO_POSRH_POS15                               (0x8000U)

