SoCXin/HC32F4A0/src/hc32f4a0sghb_template/common/hc32f4a0sghb.h
/*  Bit definition for PWC_BKR72 register  */
#define PWC_BKR72                                      (0xFFU)

/*  Bit definition for PWC_BKR73 register  */
#define PWC_BKR73                                      (0xFFU)

/*  Bit definition for PWC_BKR74 register  */
#define PWC_BKR74                                      (0xFFU)

/*  Bit definition for PWC_BKR75 register  */
#define PWC_BKR75                                      (0xFFU)

/*  Bit definition for PWC_BKR76 register  */
#define PWC_BKR76                                      (0xFFU)

/*  Bit definition for PWC_BKR77 register  */
#define PWC_BKR77                                      (0xFFU)

/*  Bit definition for PWC_BKR78 register  */
#define PWC_BKR78                                      (0xFFU)

/*  Bit definition for PWC_BKR79 register  */
#define PWC_BKR79                                      (0xFFU)

/*  Bit definition for PWC_BKR80 register  */
#define PWC_BKR80                                      (0xFFU)

/*  Bit definition for PWC_BKR81 register  */
#define PWC_BKR81                                      (0xFFU)

/*  Bit definition for PWC_BKR82 register  */
#define PWC_BKR82                                      (0xFFU)

/*  Bit definition for PWC_BKR83 register  */
#define PWC_BKR83                                      (0xFFU)

/*  Bit definition for PWC_BKR84 register  */
#define PWC_BKR84                                      (0xFFU)

/*  Bit definition for PWC_BKR85 register  */
#define PWC_BKR85                                      (0xFFU)

/*  Bit definition for PWC_BKR86 register  */
#define PWC_BKR86                                      (0xFFU)

/*  Bit definition for PWC_BKR87 register  */
#define PWC_BKR87                                      (0xFFU)

/*  Bit definition for PWC_BKR88 register  */
#define PWC_BKR88                                      (0xFFU)

/*  Bit definition for PWC_BKR89 register  */
#define PWC_BKR89                                      (0xFFU)

/*  Bit definition for PWC_BKR90 register  */
#define PWC_BKR90                                      (0xFFU)

/*  Bit definition for PWC_BKR91 register  */
#define PWC_BKR91                                      (0xFFU)

/*  Bit definition for PWC_BKR92 register  */
#define PWC_BKR92                                      (0xFFU)

/*  Bit definition for PWC_BKR93 register  */
#define PWC_BKR93                                      (0xFFU)

/*  Bit definition for PWC_BKR94 register  */
#define PWC_BKR94                                      (0xFFU)

/*  Bit definition for PWC_BKR95 register  */
#define PWC_BKR95                                      (0xFFU)

/*  Bit definition for PWC_BKR96 register  */
#define PWC_BKR96                                      (0xFFU)

/*  Bit definition for PWC_BKR97 register  */
#define PWC_BKR97                                      (0xFFU)

/*  Bit definition for PWC_BKR98 register  */
#define PWC_BKR98                                      (0xFFU)

/*  Bit definition for PWC_BKR99 register  */
#define PWC_BKR99                                      (0xFFU)

/*  Bit definition for PWC_BKR100 register  */
#define PWC_BKR100                                     (0xFFU)

/*  Bit definition for PWC_BKR101 register  */
#define PWC_BKR101                                     (0xFFU)

/*  Bit definition for PWC_BKR102 register  */
#define PWC_BKR102                                     (0xFFU)

/*  Bit definition for PWC_BKR103 register  */
#define PWC_BKR103                                     (0xFFU)

/*  Bit definition for PWC_BKR104 register  */
#define PWC_BKR104                                     (0xFFU)

/*  Bit definition for PWC_BKR105 register  */
#define PWC_BKR105                                     (0xFFU)

/*  Bit definition for PWC_BKR106 register  */
#define PWC_BKR106                                     (0xFFU)

/*  Bit definition for PWC_BKR107 register  */
#define PWC_BKR107                                     (0xFFU)

/*  Bit definition for PWC_BKR108 register  */
#define PWC_BKR108                                     (0xFFU)

/*  Bit definition for PWC_BKR109 register  */
#define PWC_BKR109                                     (0xFFU)

/*  Bit definition for PWC_BKR110 register  */
#define PWC_BKR110                                     (0xFFU)

/*  Bit definition for PWC_BKR111 register  */
#define PWC_BKR111                                     (0xFFU)

/*  Bit definition for PWC_BKR112 register  */
#define PWC_BKR112                                     (0xFFU)

/*  Bit definition for PWC_BKR113 register  */
#define PWC_BKR113                                     (0xFFU)

/*  Bit definition for PWC_BKR114 register  */
#define PWC_BKR114                                     (0xFFU)

/*  Bit definition for PWC_BKR115 register  */
#define PWC_BKR115                                     (0xFFU)

/*  Bit definition for PWC_BKR116 register  */
#define PWC_BKR116                                     (0xFFU)

/*  Bit definition for PWC_BKR117 register  */
#define PWC_BKR117                                     (0xFFU)

/*  Bit definition for PWC_BKR118 register  */
#define PWC_BKR118                                     (0xFFU)

/*  Bit definition for PWC_BKR119 register  */
#define PWC_BKR119                                     (0xFFU)

/*  Bit definition for PWC_BKR120 register  */
#define PWC_BKR120                                     (0xFFU)

/*  Bit definition for PWC_BKR121 register  */
#define PWC_BKR121                                     (0xFFU)

/*  Bit definition for PWC_BKR122 register  */
#define PWC_BKR122                                     (0xFFU)

/*  Bit definition for PWC_BKR123 register  */
#define PWC_BKR123                                     (0xFFU)

/*  Bit definition for PWC_BKR124 register  */
#define PWC_BKR124                                     (0xFFU)

/*  Bit definition for PWC_BKR125 register  */
#define PWC_BKR125                                     (0xFFU)

/*  Bit definition for PWC_BKR126 register  */
#define PWC_BKR126                                     (0xFFU)

/*  Bit definition for PWC_BKR127 register  */
#define PWC_BKR127                                     (0xFFU)

/*  Bit definition for PWC_PWRC0 register  */
#define PWC_PWRC0_PDMDS_POS                            (0U)
#define PWC_PWRC0_PDMDS                                (0x03U)
#define PWC_PWRC0_PDMDS_0                              (0x01U)
#define PWC_PWRC0_PDMDS_1                              (0x02U)
#define PWC_PWRC0_IORTN_POS                            (4U)
#define PWC_PWRC0_IORTN                                (0x30U)
#define PWC_PWRC0_IORTN_0                              (0x10U)
#define PWC_PWRC0_IORTN_1                              (0x20U)
#define PWC_PWRC0_PWDN_POS                             (7U)
#define PWC_PWRC0_PWDN                                 (0x80U)

/*  Bit definition for PWC_PWRC1 register  */
#define PWC_PWRC1_VPLLSD_POS                           (0U)
#define PWC_PWRC1_VPLLSD                               (0x03U)
#define PWC_PWRC1_VPLLSD_0                             (0x01U)
#define PWC_PWRC1_VPLLSD_1                             (0x02U)
#define PWC_PWRC1_VHRCSD_POS                           (2U)
#define PWC_PWRC1_VHRCSD                               (0x04U)
#define PWC_PWRC1_PDTS_POS                             (3U)
#define PWC_PWRC1_PDTS                                 (0x08U)
#define PWC_PWRC1_STPDAS_POS                           (6U)
#define PWC_PWRC1_STPDAS                               (0xC0U)
#define PWC_PWRC1_STPDAS_0                             (0x40U)
#define PWC_PWRC1_STPDAS_1                             (0x80U)

