SoCXin/HC32F4A0/src/hc32f4a0sghb_template/common/hc32f4a0sghb.h
/*  Bit definition for USBFS_DOEPDMA register  */
#define USBFS_DOEPDMA                                  (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL register  */
#define USBFS_DOEPCTL_MPSIZ_POS                        (0U)
#define USBFS_DOEPCTL_MPSIZ                            (0x000007FFUL)
#define USBFS_DOEPCTL_USBAEP_POS                       (15U)
#define USBFS_DOEPCTL_USBAEP                           (0x00008000UL)
#define USBFS_DOEPCTL_DPID_POS                         (16U)
#define USBFS_DOEPCTL_DPID                             (0x00010000UL)
#define USBFS_DOEPCTL_NAKSTS_POS                       (17U)
#define USBFS_DOEPCTL_NAKSTS                           (0x00020000UL)
#define USBFS_DOEPCTL_EPTYP_POS                        (18U)
#define USBFS_DOEPCTL_EPTYP                            (0x000C0000UL)
#define USBFS_DOEPCTL_SNPM_POS                         (20U)
#define USBFS_DOEPCTL_SNPM                             (0x00100000UL)
#define USBFS_DOEPCTL_STALL_POS                        (21U)
#define USBFS_DOEPCTL_STALL                            (0x00200000UL)
#define USBFS_DOEPCTL_CNAK_POS                         (26U)
#define USBFS_DOEPCTL_CNAK                             (0x04000000UL)
#define USBFS_DOEPCTL_SNAK_POS                         (27U)
#define USBFS_DOEPCTL_SNAK                             (0x08000000UL)
#define USBFS_DOEPCTL_SD0PID_POS                       (28U)
#define USBFS_DOEPCTL_SD0PID                           (0x10000000UL)
#define USBFS_DOEPCTL_SD1PID_POS                       (29U)
#define USBFS_DOEPCTL_SD1PID                           (0x20000000UL)
#define USBFS_DOEPCTL_EPDIS_POS                        (30U)
#define USBFS_DOEPCTL_EPDIS                            (0x40000000UL)
#define USBFS_DOEPCTL_EPENA_POS                        (31U)
#define USBFS_DOEPCTL_EPENA                            (0x80000000UL)

/*  Bit definition for USBFS_DOEPTSIZ register  */
#define USBFS_DOEPTSIZ_XFRSIZ_POS                      (0U)
#define USBFS_DOEPTSIZ_XFRSIZ                          (0x0007FFFFUL)
#define USBFS_DOEPTSIZ_PKTCNT_POS                      (19U)
#define USBFS_DOEPTSIZ_PKTCNT                          (0x1FF80000UL)
#define USBFS_DOEPTSIZ_RXDPID_STUPCNT_POS              (29U)
#define USBFS_DOEPTSIZ_RXDPID_STUPCNT                  (0x60000000UL)

/*  Bit definition for USBFS_GCCTL register  */
#define USBFS_GCCTL_STPPCLK_POS                        (0U)
#define USBFS_GCCTL_STPPCLK                            (0x00000001UL)
#define USBFS_GCCTL_GATEHCLK_POS                       (1U)
#define USBFS_GCCTL_GATEHCLK                           (0x00000002UL)
#define USBFS_GCCTL_ENL1GTG_POS                        (5U)
#define USBFS_GCCTL_ENL1GTG                            (0x00000020UL)
#define USBFS_GCCTL_PHYSLEEP_POS                       (6U)
#define USBFS_GCCTL_PHYSLEEP                           (0x00000040UL)
#define USBFS_GCCTL_SUSP_POS                           (7U)
#define USBFS_GCCTL_SUSP                               (0x00000080UL)

/*******************************************************************************
                Bit definition for Peripheral USBHS
*******************************************************************************/
/*  Bit definition for USBHS_GVBUSCFG register  */
#define USBHS_GVBUSCFG_VBUSOVEN_POS                    (6U)
#define USBHS_GVBUSCFG_VBUSOVEN                        (0x00000040UL)
#define USBHS_GVBUSCFG_VBUSVAL_POS                     (7U)
#define USBHS_GVBUSCFG_VBUSVAL                         (0x00000080UL)

/*  Bit definition for USBHS_GAHBCFG register  */
#define USBHS_GAHBCFG_GINTMSK_POS                      (0U)
#define USBHS_GAHBCFG_GINTMSK                          (0x00000001UL)
#define USBHS_GAHBCFG_HBSTLEN_POS                      (1U)
#define USBHS_GAHBCFG_HBSTLEN                          (0x0000001EUL)
#define USBHS_GAHBCFG_DMAEN_POS                        (5U)
#define USBHS_GAHBCFG_DMAEN                            (0x00000020UL)
#define USBHS_GAHBCFG_TXFELVL_POS                      (7U)
#define USBHS_GAHBCFG_TXFELVL                          (0x00000080UL)
#define USBHS_GAHBCFG_PTXFELVL_POS                     (8U)
#define USBHS_GAHBCFG_PTXFELVL                         (0x00000100UL)

/*  Bit definition for USBHS_GUSBCFG register  */
#define USBHS_GUSBCFG_TOCAL_POS                        (0U)
#define USBHS_GUSBCFG_TOCAL                            (0x00000007UL)
#define USBHS_GUSBCFG_PHYSEL_POS                       (6U)
#define USBHS_GUSBCFG_PHYSEL                           (0x00000040UL)
#define USBHS_GUSBCFG_TRDT_POS                         (10U)
#define USBHS_GUSBCFG_TRDT                             (0x00003C00UL)
#define USBHS_GUSBCFG_PHYLPCS_POS                      (15U)
#define USBHS_GUSBCFG_PHYLPCS                          (0x00008000UL)
#define USBHS_GUSBCFG_ULFSLS_POS                       (17U)
#define USBHS_GUSBCFG_ULFSLS                           (0x00020000UL)
#define USBHS_GUSBCFG_ULPIAR_POS                       (18U)
#define USBHS_GUSBCFG_ULPIAR                           (0x00040000UL)
#define USBHS_GUSBCFG_ULPICSM_POS                      (19U)
#define USBHS_GUSBCFG_ULPICSM                          (0x00080000UL)
#define USBHS_GUSBCFG_ULPIEVBUSD_POS                   (20U)
#define USBHS_GUSBCFG_ULPIEVBUSD                       (0x00100000UL)
#define USBHS_GUSBCFG_ULPIEVBUSI_POS                   (21U)
#define USBHS_GUSBCFG_ULPIEVBUSI                       (0x00200000UL)
#define USBHS_GUSBCFG_PCCI_POS                         (23U)
#define USBHS_GUSBCFG_PCCI                             (0x00800000UL)
#define USBHS_GUSBCFG_PTCI_POS                         (24U)
#define USBHS_GUSBCFG_PTCI                             (0x01000000UL)
#define USBHS_GUSBCFG_ULPIPD_POS                       (25U)
#define USBHS_GUSBCFG_ULPIPD                           (0x02000000UL)
#define USBHS_GUSBCFG_FHMOD_POS                        (29U)
#define USBHS_GUSBCFG_FHMOD                            (0x20000000UL)
#define USBHS_GUSBCFG_FDMOD_POS                        (30U)
#define USBHS_GUSBCFG_FDMOD                            (0x40000000UL)

/*  Bit definition for USBHS_GRSTCTL register  */
#define USBHS_GRSTCTL_CSRST_POS                        (0U)
#define USBHS_GRSTCTL_CSRST                            (0x00000001UL)
#define USBHS_GRSTCTL_HSRST_POS                        (1U)
#define USBHS_GRSTCTL_HSRST                            (0x00000002UL)
#define USBHS_GRSTCTL_FCRST_POS                        (2U)
#define USBHS_GRSTCTL_FCRST                            (0x00000004UL)
#define USBHS_GRSTCTL_RXFFLSH_POS                      (4U)
#define USBHS_GRSTCTL_RXFFLSH                          (0x00000010UL)
#define USBHS_GRSTCTL_TXFFLSH_POS                      (5U)
#define USBHS_GRSTCTL_TXFFLSH                          (0x00000020UL)
#define USBHS_GRSTCTL_TXFNUM_POS                       (6U)
#define USBHS_GRSTCTL_TXFNUM                           (0x000007C0UL)
#define USBHS_GRSTCTL_DMAREQ_POS                       (30U)
#define USBHS_GRSTCTL_DMAREQ                           (0x40000000UL)
#define USBHS_GRSTCTL_AHBIDL_POS                       (31U)
#define USBHS_GRSTCTL_AHBIDL                           (0x80000000UL)

/*  Bit definition for USBHS_GINTSTS register  */
#define USBHS_GINTSTS_CMOD_POS                         (0U)
#define USBHS_GINTSTS_CMOD                             (0x00000001UL)
#define USBHS_GINTSTS_MMIS_POS                         (1U)
#define USBHS_GINTSTS_MMIS                             (0x00000002UL)
#define USBHS_GINTSTS_SOF_POS                          (3U)
#define USBHS_GINTSTS_SOF                              (0x00000008UL)
#define USBHS_GINTSTS_RXFNE_POS                        (4U)
#define USBHS_GINTSTS_RXFNE                            (0x00000010UL)
#define USBHS_GINTSTS_NPTXFE_POS                       (5U)
#define USBHS_GINTSTS_NPTXFE                           (0x00000020UL)
#define USBHS_GINTSTS_GINAKEFF_POS                     (6U)
#define USBHS_GINTSTS_GINAKEFF                         (0x00000040UL)
#define USBHS_GINTSTS_GONAKEFF_POS                     (7U)
#define USBHS_GINTSTS_GONAKEFF                         (0x00000080UL)
#define USBHS_GINTSTS_ESUSP_POS                        (10U)
#define USBHS_GINTSTS_ESUSP                            (0x00000400UL)
#define USBHS_GINTSTS_USBSUSP_POS                      (11U)
#define USBHS_GINTSTS_USBSUSP                          (0x00000800UL)
#define USBHS_GINTSTS_USBRST_POS                       (12U)
#define USBHS_GINTSTS_USBRST                           (0x00001000UL)
#define USBHS_GINTSTS_ENUMDNE_POS                      (13U)
#define USBHS_GINTSTS_ENUMDNE                          (0x00002000UL)
#define USBHS_GINTSTS_ISOODRP_POS                      (14U)
#define USBHS_GINTSTS_ISOODRP                          (0x00004000UL)
#define USBHS_GINTSTS_EOPF_POS                         (15U)
#define USBHS_GINTSTS_EOPF                             (0x00008000UL)
#define USBHS_GINTSTS_IEPINT_POS                       (18U)
#define USBHS_GINTSTS_IEPINT                           (0x00040000UL)
#define USBHS_GINTSTS_OEPINT_POS                       (19U)
#define USBHS_GINTSTS_OEPINT                           (0x00080000UL)
#define USBHS_GINTSTS_IISOIXFR_POS                     (20U)
#define USBHS_GINTSTS_IISOIXFR                         (0x00100000UL)
#define USBHS_GINTSTS_IPXFR_INCOMPISOOUT_POS           (21U)
#define USBHS_GINTSTS_IPXFR_INCOMPISOOUT               (0x00200000UL)
#define USBHS_GINTSTS_DATAFSUSP_POS                    (22U)
#define USBHS_GINTSTS_DATAFSUSP                        (0x00400000UL)
#define USBHS_GINTSTS_HPRTINT_POS                      (24U)
#define USBHS_GINTSTS_HPRTINT                          (0x01000000UL)
#define USBHS_GINTSTS_HCINT_POS                        (25U)
#define USBHS_GINTSTS_HCINT                            (0x02000000UL)
#define USBHS_GINTSTS_PTXFE_POS                        (26U)
#define USBHS_GINTSTS_PTXFE                            (0x04000000UL)
#define USBHS_GINTSTS_LPMINT_POS                       (27U)
#define USBHS_GINTSTS_LPMINT                           (0x08000000UL)
#define USBHS_GINTSTS_CIDSCHG_POS                      (28U)
#define USBHS_GINTSTS_CIDSCHG                          (0x10000000UL)
#define USBHS_GINTSTS_DISCINT_POS                      (29U)
#define USBHS_GINTSTS_DISCINT                          (0x20000000UL)
#define USBHS_GINTSTS_VBUSVINT_POS                     (30U)
#define USBHS_GINTSTS_VBUSVINT                         (0x40000000UL)
#define USBHS_GINTSTS_WKUINT_POS                       (31U)
#define USBHS_GINTSTS_WKUINT                           (0x80000000UL)

/*  Bit definition for USBHS_GINTMSK register  */
#define USBHS_GINTMSK_MMISM_POS                        (1U)
#define USBHS_GINTMSK_MMISM                            (0x00000002UL)
#define USBHS_GINTMSK_SOFM_POS                         (3U)
#define USBHS_GINTMSK_SOFM                             (0x00000008UL)
#define USBHS_GINTMSK_RXFNEM_POS                       (4U)
#define USBHS_GINTMSK_RXFNEM                           (0x00000010UL)
#define USBHS_GINTMSK_NPTXFEM_POS                      (5U)
#define USBHS_GINTMSK_NPTXFEM                          (0x00000020UL)
#define USBHS_GINTMSK_GINAKEFFM_POS                    (6U)
#define USBHS_GINTMSK_GINAKEFFM                        (0x00000040UL)
#define USBHS_GINTMSK_GONAKEFFM_POS                    (7U)
#define USBHS_GINTMSK_GONAKEFFM                        (0x00000080UL)
#define USBHS_GINTMSK_ESUSPM_POS                       (10U)
#define USBHS_GINTMSK_ESUSPM                           (0x00000400UL)
#define USBHS_GINTMSK_USBSUSPM_POS                     (11U)
#define USBHS_GINTMSK_USBSUSPM                         (0x00000800UL)
#define USBHS_GINTMSK_USBRSTM_POS                      (12U)
#define USBHS_GINTMSK_USBRSTM                          (0x00001000UL)
#define USBHS_GINTMSK_ENUMDNEM_POS                     (13U)
#define USBHS_GINTMSK_ENUMDNEM                         (0x00002000UL)
#define USBHS_GINTMSK_ISOODRPM_POS                     (14U)
#define USBHS_GINTMSK_ISOODRPM                         (0x00004000UL)
#define USBHS_GINTMSK_EOPFM_POS                        (15U)
#define USBHS_GINTMSK_EOPFM                            (0x00008000UL)
#define USBHS_GINTMSK_IEPIM_POS                        (18U)
#define USBHS_GINTMSK_IEPIM                            (0x00040000UL)
#define USBHS_GINTMSK_OEPIM_POS                        (19U)
#define USBHS_GINTMSK_OEPIM                            (0x00080000UL)
#define USBHS_GINTMSK_IISOIXFRM_POS                    (20U)
#define USBHS_GINTMSK_IISOIXFRM                        (0x00100000UL)
#define USBHS_GINTMSK_IPXFRM_INCOMPISOOUTM_POS         (21U)
#define USBHS_GINTMSK_IPXFRM_INCOMPISOOUTM             (0x00200000UL)
#define USBHS_GINTMSK_DATAFSUSPM_POS                   (22U)
#define USBHS_GINTMSK_DATAFSUSPM                       (0x00400000UL)
#define USBHS_GINTMSK_HPRTIM_POS                       (24U)
#define USBHS_GINTMSK_HPRTIM                           (0x01000000UL)
#define USBHS_GINTMSK_HCIM_POS                         (25U)
#define USBHS_GINTMSK_HCIM                             (0x02000000UL)
#define USBHS_GINTMSK_PTXFEM_POS                       (26U)
#define USBHS_GINTMSK_PTXFEM                           (0x04000000UL)
#define USBHS_GINTMSK_LPMINTM_POS                      (27U)
#define USBHS_GINTMSK_LPMINTM                          (0x08000000UL)
#define USBHS_GINTMSK_CIDSCHGM_POS                     (28U)
#define USBHS_GINTMSK_CIDSCHGM                         (0x10000000UL)
#define USBHS_GINTMSK_DISCIM_POS                       (29U)
#define USBHS_GINTMSK_DISCIM                           (0x20000000UL)
#define USBHS_GINTMSK_VBUSVIM_POS                      (30U)
#define USBHS_GINTMSK_VBUSVIM                          (0x40000000UL)
#define USBHS_GINTMSK_WKUIM_POS                        (31U)
#define USBHS_GINTMSK_WKUIM                            (0x80000000UL)

/*  Bit definition for USBHS_GRXSTSR register  */
#define USBHS_GRXSTSR_CHNUM_EPNUM_POS                  (0U)
#define USBHS_GRXSTSR_CHNUM_EPNUM                      (0x0000000FUL)
#define USBHS_GRXSTSR_BCNT_POS                         (4U)
#define USBHS_GRXSTSR_BCNT                             (0x00007FF0UL)
#define USBHS_GRXSTSR_DPID_POS                         (15U)
#define USBHS_GRXSTSR_DPID                             (0x00018000UL)
#define USBHS_GRXSTSR_PKTSTS_POS                       (17U)
#define USBHS_GRXSTSR_PKTSTS                           (0x001E0000UL)

/*  Bit definition for USBHS_GRXSTSP register  */
#define USBHS_GRXSTSP_CHNUM_EPNUM_POS                  (0U)
#define USBHS_GRXSTSP_CHNUM_EPNUM                      (0x0000000FUL)
#define USBHS_GRXSTSP_BCNT_POS                         (4U)
#define USBHS_GRXSTSP_BCNT                             (0x00007FF0UL)
#define USBHS_GRXSTSP_DPID_POS                         (15U)
#define USBHS_GRXSTSP_DPID                             (0x00018000UL)
#define USBHS_GRXSTSP_PKTSTS_POS                       (17U)
#define USBHS_GRXSTSP_PKTSTS                           (0x001E0000UL)

