SoCXin/HC32F4A0/src/hc32f4a0sghb_template/common/hc32f4a0sghb.h
/*  Bit definition for USBHS_DIEPTSIZ0 register  */
#define USBHS_DIEPTSIZ0_XFRSIZ_POS                     (0U)
#define USBHS_DIEPTSIZ0_XFRSIZ                         (0x0000007FUL)
#define USBHS_DIEPTSIZ0_PKTCNT_POS                     (19U)
#define USBHS_DIEPTSIZ0_PKTCNT                         (0x00180000UL)

/*  Bit definition for USBHS_DIEPDMA register  */
#define USBHS_DIEPDMA                                  (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS register  */
#define USBHS_DTXFSTS_INEPTFSAV                        (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL register  */
#define USBHS_DIEPCTL_MPSIZ_POS                        (0U)
#define USBHS_DIEPCTL_MPSIZ                            (0x000007FFUL)
#define USBHS_DIEPCTL_USBAEP_POS                       (15U)
#define USBHS_DIEPCTL_USBAEP                           (0x00008000UL)
#define USBHS_DIEPCTL_EONUM_DPID_POS                   (16U)
#define USBHS_DIEPCTL_EONUM_DPID                       (0x00010000UL)
#define USBHS_DIEPCTL_NAKSTS_POS                       (17U)
#define USBHS_DIEPCTL_NAKSTS                           (0x00020000UL)
#define USBHS_DIEPCTL_EPTYP_POS                        (18U)
#define USBHS_DIEPCTL_EPTYP                            (0x000C0000UL)
#define USBHS_DIEPCTL_STALL_POS                        (21U)
#define USBHS_DIEPCTL_STALL                            (0x00200000UL)
#define USBHS_DIEPCTL_TXFNUM_POS                       (22U)
#define USBHS_DIEPCTL_TXFNUM                           (0x03C00000UL)
#define USBHS_DIEPCTL_CNAK_POS                         (26U)
#define USBHS_DIEPCTL_CNAK                             (0x04000000UL)
#define USBHS_DIEPCTL_SNAK_POS                         (27U)
#define USBHS_DIEPCTL_SNAK                             (0x08000000UL)
#define USBHS_DIEPCTL_SD0PID_SEVNFRM_POS               (28U)
#define USBHS_DIEPCTL_SD0PID_SEVNFRM                   (0x10000000UL)
#define USBHS_DIEPCTL_SODDFRM_POS                      (29U)
#define USBHS_DIEPCTL_SODDFRM                          (0x20000000UL)
#define USBHS_DIEPCTL_EPDIS_POS                        (30U)
#define USBHS_DIEPCTL_EPDIS                            (0x40000000UL)
#define USBHS_DIEPCTL_EPENA_POS                        (31U)
#define USBHS_DIEPCTL_EPENA                            (0x80000000UL)

/*  Bit definition for USBHS_DIEPTSIZ register  */
#define USBHS_DIEPTSIZ_XFRSIZ_POS                      (0U)
#define USBHS_DIEPTSIZ_XFRSIZ                          (0x0007FFFFUL)
#define USBHS_DIEPTSIZ_PKTCNT_POS                      (19U)
#define USBHS_DIEPTSIZ_PKTCNT                          (0x1FF80000UL)
#define USBHS_DIEPTSIZ_MCNT_POS                        (29U)
#define USBHS_DIEPTSIZ_MCNT                            (0x60000000UL)

/*  Bit definition for USBHS_DOEPCTL0 register  */
#define USBHS_DOEPCTL0_MPSIZ_POS                       (0U)
#define USBHS_DOEPCTL0_MPSIZ                           (0x00000003UL)
#define USBHS_DOEPCTL0_USBAEP_POS                      (15U)
#define USBHS_DOEPCTL0_USBAEP                          (0x00008000UL)
#define USBHS_DOEPCTL0_NAKSTS_POS                      (17U)
#define USBHS_DOEPCTL0_NAKSTS                          (0x00020000UL)
#define USBHS_DOEPCTL0_EPTYP_POS                       (18U)
#define USBHS_DOEPCTL0_EPTYP                           (0x000C0000UL)
#define USBHS_DOEPCTL0_EPTYP_0                         (0x00040000UL)
#define USBHS_DOEPCTL0_EPTYP_1                         (0x00080000UL)
#define USBHS_DOEPCTL0_SNPM_POS                        (20U)
#define USBHS_DOEPCTL0_SNPM                            (0x00100000UL)
#define USBHS_DOEPCTL0_STALL_POS                       (21U)
#define USBHS_DOEPCTL0_STALL                           (0x00200000UL)
#define USBHS_DOEPCTL0_CNAK_POS                        (26U)
#define USBHS_DOEPCTL0_CNAK                            (0x04000000UL)
#define USBHS_DOEPCTL0_SNAK_POS                        (27U)
#define USBHS_DOEPCTL0_SNAK                            (0x08000000UL)
#define USBHS_DOEPCTL0_EPDIS_POS                       (30U)
#define USBHS_DOEPCTL0_EPDIS                           (0x40000000UL)
#define USBHS_DOEPCTL0_EPENA_POS                       (31U)
#define USBHS_DOEPCTL0_EPENA                           (0x80000000UL)

/*  Bit definition for USBHS_DOEPINT register  */
#define USBHS_DOEPINT_XFRC_POS                         (0U)
#define USBHS_DOEPINT_XFRC                             (0x00000001UL)
#define USBHS_DOEPINT_EPDISD_POS                       (1U)
#define USBHS_DOEPINT_EPDISD                           (0x00000002UL)
#define USBHS_DOEPINT_STUP_POS                         (3U)
#define USBHS_DOEPINT_STUP                             (0x00000008UL)
#define USBHS_DOEPINT_OTEPDIS_POS                      (4U)
#define USBHS_DOEPINT_OTEPDIS                          (0x00000010UL)
#define USBHS_DOEPINT_B2BSTUP_POS                      (6U)
#define USBHS_DOEPINT_B2BSTUP                          (0x00000040UL)
#define USBHS_DOEPINT_NYET_POS                         (14U)
#define USBHS_DOEPINT_NYET                             (0x00004000UL)

/*  Bit definition for USBHS_DOEPTSIZ0 register  */
#define USBHS_DOEPTSIZ0_XFRSIZ_POS                     (0U)
#define USBHS_DOEPTSIZ0_XFRSIZ                         (0x0000007FUL)
#define USBHS_DOEPTSIZ0_PKTCNT_POS                     (19U)
#define USBHS_DOEPTSIZ0_PKTCNT                         (0x00080000UL)
#define USBHS_DOEPTSIZ0_STUPCNT_POS                    (29U)
#define USBHS_DOEPTSIZ0_STUPCNT                        (0x60000000UL)

/*  Bit definition for USBHS_DOEPDMA register  */
#define USBHS_DOEPDMA                                  (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DOEPCTL register  */
#define USBHS_DOEPCTL_MPSIZ_POS                        (0U)
#define USBHS_DOEPCTL_MPSIZ                            (0x000007FFUL)
#define USBHS_DOEPCTL_USBAEP_POS                       (15U)
#define USBHS_DOEPCTL_USBAEP                           (0x00008000UL)
#define USBHS_DOEPCTL_DPID_POS                         (16U)
#define USBHS_DOEPCTL_DPID                             (0x00010000UL)
#define USBHS_DOEPCTL_NAKSTS_POS                       (17U)
#define USBHS_DOEPCTL_NAKSTS                           (0x00020000UL)
#define USBHS_DOEPCTL_EPTYP_POS                        (18U)
#define USBHS_DOEPCTL_EPTYP                            (0x000C0000UL)
#define USBHS_DOEPCTL_SNPM_POS                         (20U)
#define USBHS_DOEPCTL_SNPM                             (0x00100000UL)
#define USBHS_DOEPCTL_STALL_POS                        (21U)
#define USBHS_DOEPCTL_STALL                            (0x00200000UL)
#define USBHS_DOEPCTL_CNAK_POS                         (26U)
#define USBHS_DOEPCTL_CNAK                             (0x04000000UL)
#define USBHS_DOEPCTL_SNAK_POS                         (27U)
#define USBHS_DOEPCTL_SNAK                             (0x08000000UL)
#define USBHS_DOEPCTL_SD0PID_POS                       (28U)
#define USBHS_DOEPCTL_SD0PID                           (0x10000000UL)
#define USBHS_DOEPCTL_SD1PID_POS                       (29U)
#define USBHS_DOEPCTL_SD1PID                           (0x20000000UL)
#define USBHS_DOEPCTL_EPDIS_POS                        (30U)
#define USBHS_DOEPCTL_EPDIS                            (0x40000000UL)
#define USBHS_DOEPCTL_EPENA_POS                        (31U)
#define USBHS_DOEPCTL_EPENA                            (0x80000000UL)

/*  Bit definition for USBHS_DOEPTSIZ register  */
#define USBHS_DOEPTSIZ_XFRSIZ_POS                      (0U)
#define USBHS_DOEPTSIZ_XFRSIZ                          (0x0007FFFFUL)
#define USBHS_DOEPTSIZ_PKTCNT_POS                      (19U)
#define USBHS_DOEPTSIZ_PKTCNT                          (0x1FF80000UL)
#define USBHS_DOEPTSIZ_RXDPID_STUPCNT_POS              (29U)
#define USBHS_DOEPTSIZ_RXDPID_STUPCNT                  (0x60000000UL)

/*  Bit definition for USBHS_GCCTL register  */
#define USBHS_GCCTL_STPPCLK_POS                        (0U)
#define USBHS_GCCTL_STPPCLK                            (0x00000001UL)
#define USBHS_GCCTL_GATEHCLK_POS                       (1U)
#define USBHS_GCCTL_GATEHCLK                           (0x00000002UL)
#define USBHS_GCCTL_ENL1GTG_POS                        (5U)
#define USBHS_GCCTL_ENL1GTG                            (0x00000020UL)
#define USBHS_GCCTL_PHYSLEEP_POS                       (6U)
#define USBHS_GCCTL_PHYSLEEP                           (0x00000040UL)
#define USBHS_GCCTL_SUSP_POS                           (7U)
#define USBHS_GCCTL_SUSP                               (0x00000080UL)

