SoCXin/HC32F4A0/src/hc32f4a0sghb_template/common/hc32f4a0sghb.h
typedef struct
{
    __IO uint32_t L3PEN;
    uint32_t RESERVED0[1];
    __IO uint32_t L3SAM;
    __IO uint32_t L3SAIM;
    __IO uint32_t L3DAM;
    __IO uint32_t L3DAIM;
    __IO uint32_t L3HSBM0;
    __IO uint32_t L3HSBM1;
    __IO uint32_t L3HSBM2;
    __IO uint32_t L3HSBM3;
    __IO uint32_t L3HSBM4;
    __IO uint32_t L3HDBM0;
    __IO uint32_t L3HDBM1;
    __IO uint32_t L3HDBM2;
    __IO uint32_t L3HDBM3;
    __IO uint32_t L3HDBM4;
    __IO uint32_t L4PEN;
    uint32_t RESERVED1[1];
    __IO uint32_t L4SPM;
    __IO uint32_t L4SPIM;
    __IO uint32_t L4DPM;
    __IO uint32_t L4DPIM;
    uint32_t RESERVED2[10];
} stc_eth_mac_l34ctlr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
    __IO uint32_t VLANC0;
    __IO uint32_t VLANC1;
    __IO uint32_t VLANS;
    uint32_t RESERVED1[13];
} stc_eth_mac_vtactlr_bit_t;

typedef struct
{
    __IO uint32_t TSPEN;
    __IO uint32_t TSPUPSEL;
    __IO uint32_t TSPINI;
    __IO uint32_t TSPUP;
    __IO uint32_t TSPINT;
    __IO uint32_t TSPADUP;
    uint32_t RESERVED0[2];
    __IO uint32_t TSPEALL;
    __IO uint32_t TSPSSR;
    __IO uint32_t TSPVER;
    __IO uint32_t TSPOVETH;
    __IO uint32_t TSPOVIPV6;
    __IO uint32_t TSPOVIPV4;
    __IO uint32_t TSPMTSEL0;
    __IO uint32_t TSPMTSEL1;
    __IO uint32_t TSPMTSEL2;
    __IO uint32_t TSPMTSEL3;
    __IO uint32_t TSPADF;
    uint32_t RESERVED1[13];
} stc_eth_ptp_tspctlr_bit_t;

typedef struct
{
    uint32_t RESERVED0[31];
    __IO uint32_t TSPUPNS;
} stc_eth_ptp_tmunser_bit_t;

typedef struct
{
    __IO uint32_t TSOVF;
    __IO uint32_t TSTAR0;
    uint32_t RESERVED0[1];
    __IO uint32_t TSERR0;
    __IO uint32_t TSTAR1;
    __IO uint32_t TSERR1;
    uint32_t RESERVED1[26];
} stc_eth_ptp_tspstsr_bit_t;

typedef struct
{
    __IO uint32_t PPSFRE00;
    __IO uint32_t PPSFRE01;
    __IO uint32_t PPSFRE02;
    __IO uint32_t PPSFRE03;
    __IO uint32_t PPSOMD;
    __IO uint32_t TT0SEL0;
    __IO uint32_t TT0SEL1;
    uint32_t RESERVED0[1];
    __IO uint32_t PPSFRE10;
    __IO uint32_t PPSFRE11;
    __IO uint32_t PPSFRE12;
    uint32_t RESERVED1[2];
    __IO uint32_t TT1SEL0;
    __IO uint32_t TT1SEL1;
    uint32_t RESERVED2[17];
} stc_eth_ptp_ppsctlr_bit_t;

typedef struct
{
    __IO uint32_t SWR;
    __IO uint32_t DMAA;
    __IO uint32_t DSL0;
    __IO uint32_t DSL1;
    __IO uint32_t DSL2;
    __IO uint32_t DSL3;
    __IO uint32_t DSL4;
    __IO uint32_t DSEN;
    __IO uint32_t TPBL0;
    __IO uint32_t TPBL1;
    __IO uint32_t TPBL2;
    __IO uint32_t TPBL3;
    __IO uint32_t TPBL4;
    __IO uint32_t TPBL5;
    __IO uint32_t PRAT0;
    __IO uint32_t PRAT1;
    __IO uint32_t FBST;
    __IO uint32_t RPBL0;
    __IO uint32_t RPBL1;
    __IO uint32_t RPBL2;
    __IO uint32_t RPBL3;
    __IO uint32_t RPBL4;
    __IO uint32_t RPBL5;
    __IO uint32_t SPBL;
    __IO uint32_t M8PBL;
    __IO uint32_t AAL;
    __IO uint32_t MBST;
    __IO uint32_t TXPR;
    uint32_t RESERVED0[4];
} stc_eth_dma_busmodr_bit_t;

typedef struct
{
    __IO uint32_t TIS;
    __IO uint32_t TSS;
    __IO uint32_t TUS;
    __IO uint32_t TJS;
    __IO uint32_t OVS;
    __IO uint32_t UNS;
    __IO uint32_t RIS;
    __IO uint32_t RUS;
    __IO uint32_t RSS;
    __IO uint32_t RWS;
    __IO uint32_t ETS;
    uint32_t RESERVED0[2];
    __IO uint32_t FBS;
    __IO uint32_t ERS;
    __IO uint32_t AIS;
    __IO uint32_t NIS;
    __IO uint32_t RSTS0;
    __IO uint32_t RSTS1;
    __IO uint32_t RSTS2;
    __IO uint32_t TSTS0;
    __IO uint32_t TSTS1;
    __IO uint32_t TSTS2;
    __IO uint32_t EBUS0;
    __IO uint32_t EBUS1;
    __IO uint32_t EBUS2;
    uint32_t RESERVED1[1];
    __IO uint32_t MMCS;
    __IO uint32_t PMTS;
    __IO uint32_t PTPS;
    uint32_t RESERVED2[2];
} stc_eth_dma_dmastsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t STR;
    __IO uint32_t OSF;
    __IO uint32_t RTC0;
    __IO uint32_t RTC1;
    __IO uint32_t DGF;
    __IO uint32_t FUF;
    __IO uint32_t FEF;
    uint32_t RESERVED1[5];
    __IO uint32_t STT;
    __IO uint32_t TTC0;
    __IO uint32_t TTC1;
    __IO uint32_t TTC2;
    uint32_t RESERVED2[3];
    __IO uint32_t FTF;
    __IO uint32_t TSF;
    uint32_t RESERVED3[2];
    __IO uint32_t DFRF;
    __IO uint32_t RSF;
    __IO uint32_t DTCOE;
    uint32_t RESERVED4[5];
} stc_eth_dma_oprmodr_bit_t;

typedef struct
{
    __IO uint32_t TIE;
    __IO uint32_t TSE;
    __IO uint32_t TUE;
    __IO uint32_t TJE;
    __IO uint32_t OVE;
    __IO uint32_t UNE;
    __IO uint32_t RIE;
    __IO uint32_t RUE;
    __IO uint32_t RSE;
    __IO uint32_t RWE;
    __IO uint32_t ETE;
    uint32_t RESERVED0[2];
    __IO uint32_t FBE;
    __IO uint32_t ERE;
    __IO uint32_t AIE;
    __IO uint32_t NIE;
    uint32_t RESERVED1[15];
} stc_eth_dma_intenar_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
    __IO uint32_t UNAOVF;
    uint32_t RESERVED1[11];
    __IO uint32_t OVFOVF;
    uint32_t RESERVED2[3];
} stc_eth_dma_rfrcntr_bit_t;

typedef struct
{
    __IO uint32_t START;
    uint32_t RESERVED0[31];
} stc_fcm_str_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t INEXS;
    __IO uint32_t DNFS0;
    __IO uint32_t DNFS1;
    uint32_t RESERVED1[2];
    __IO uint32_t EDGES0;
    __IO uint32_t EDGES1;
    uint32_t RESERVED2[1];
    __IO uint32_t EXREFE;
    uint32_t RESERVED3[16];
} stc_fcm_rccr_bit_t;

typedef struct
{
    __IO uint32_t ERRIE;
    __IO uint32_t MENDIE;
    __IO uint32_t OVFIE;
    uint32_t RESERVED0[1];
    __IO uint32_t ERRINTRS;
    uint32_t RESERVED1[2];
    __IO uint32_t ERRE;
    uint32_t RESERVED2[24];
} stc_fcm_rier_bit_t;

typedef struct
{
    __IO uint32_t ERRF;
    __IO uint32_t MENDF;
    __IO uint32_t OVF;
    uint32_t RESERVED0[29];
} stc_fcm_sr_bit_t;

typedef struct
{
    __IO uint32_t ERRFCLR;
    __IO uint32_t MENDFCLR;
    __IO uint32_t OVFCLR;
    uint32_t RESERVED0[29];
} stc_fcm_clr_bit_t;

typedef struct
{
    __IO uint32_t FMACEN;
    uint32_t RESERVED0[31];
} stc_fmac_enr_bit_t;

typedef struct
{
    __IO uint32_t INTEN;
    uint32_t RESERVED0[31];
} stc_fmac_ier_bit_t;

typedef struct
{
    uint32_t RESERVED0[31];
    __IO uint32_t READY;
} stc_fmac_str_bit_t;

typedef struct
{
    __IO uint32_t PIN00;
    __IO uint32_t PIN01;
    __IO uint32_t PIN02;
    __IO uint32_t PIN03;
    __IO uint32_t PIN04;
    __IO uint32_t PIN05;
    __IO uint32_t PIN06;
    __IO uint32_t PIN07;
    __IO uint32_t PIN08;
    __IO uint32_t PIN09;
    __IO uint32_t PIN10;
    __IO uint32_t PIN11;
    __IO uint32_t PIN12;
    __IO uint32_t PIN13;
    __IO uint32_t PIN14;
    __IO uint32_t PIN15;
} stc_gpio_pidra_bit_t;

typedef struct
{
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    __IO uint32_t POUT02;
    __IO uint32_t POUT03;
    __IO uint32_t POUT04;
    __IO uint32_t POUT05;
    __IO uint32_t POUT06;
    __IO uint32_t POUT07;
    __IO uint32_t POUT08;
    __IO uint32_t POUT09;
    __IO uint32_t POUT10;
    __IO uint32_t POUT11;
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    __IO uint32_t POUT14;
    __IO uint32_t POUT15;
} stc_gpio_podra_bit_t;

typedef struct
{
    __IO uint32_t POUTE00;
    __IO uint32_t POUTE01;
    __IO uint32_t POUTE02;
    __IO uint32_t POUTE03;
    __IO uint32_t POUTE04;
    __IO uint32_t POUTE05;
    __IO uint32_t POUTE06;
    __IO uint32_t POUTE07;
    __IO uint32_t POUTE08;
    __IO uint32_t POUTE09;
    __IO uint32_t POUTE10;
    __IO uint32_t POUTE11;
    __IO uint32_t POUTE12;
    __IO uint32_t POUTE13;
    __IO uint32_t POUTE14;
    __IO uint32_t POUTE15;
} stc_gpio_poera_bit_t;

typedef struct
{
    __IO uint32_t POS00;
    __IO uint32_t POS01;
    __IO uint32_t POS02;
    __IO uint32_t POS03;
    __IO uint32_t POS04;
    __IO uint32_t POS05;
    __IO uint32_t POS06;
    __IO uint32_t POS07;
    __IO uint32_t POS08;
    __IO uint32_t POS09;
    __IO uint32_t POS10;
    __IO uint32_t POS11;
    __IO uint32_t POS12;
    __IO uint32_t POS13;
    __IO uint32_t POS14;
    __IO uint32_t POS15;
} stc_gpio_posra_bit_t;

typedef struct
{
    __IO uint32_t POR00;
    __IO uint32_t POR01;
    __IO uint32_t POR02;
    __IO uint32_t POR03;
    __IO uint32_t POR04;
    __IO uint32_t POR05;
    __IO uint32_t POR06;
    __IO uint32_t POR07;
    __IO uint32_t POR08;
    __IO uint32_t POR09;
    __IO uint32_t POR10;
    __IO uint32_t POR11;
    __IO uint32_t POR12;
    __IO uint32_t POR13;
    __IO uint32_t POR14;
    __IO uint32_t POR15;
} stc_gpio_porra_bit_t;

typedef struct
{
    __IO uint32_t POT00;
    __IO uint32_t POT01;
    __IO uint32_t POT02;
    __IO uint32_t POT03;
    __IO uint32_t POT04;
    __IO uint32_t POT05;
    __IO uint32_t POT06;
    __IO uint32_t POT07;
    __IO uint32_t POT08;
    __IO uint32_t POT09;
    __IO uint32_t POT10;
    __IO uint32_t POT11;
    __IO uint32_t POT12;
    __IO uint32_t POT13;
    __IO uint32_t POT14;
    __IO uint32_t POT15;
} stc_gpio_potra_bit_t;

typedef struct
{
    __IO uint32_t PIN00;
    __IO uint32_t PIN01;
    __IO uint32_t PIN02;
    __IO uint32_t PIN03;
    __IO uint32_t PIN04;
    __IO uint32_t PIN05;
    __IO uint32_t PIN06;
    __IO uint32_t PIN07;
    __IO uint32_t PIN08;
    __IO uint32_t PIN09;
    __IO uint32_t PIN10;
    __IO uint32_t PIN11;
    __IO uint32_t PIN12;
    __IO uint32_t PIN13;
    __IO uint32_t PIN14;
    __IO uint32_t PIN15;
} stc_gpio_pidrb_bit_t;

typedef struct
{
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    __IO uint32_t POUT02;
    __IO uint32_t POUT03;
    __IO uint32_t POUT04;
    __IO uint32_t POUT05;
    __IO uint32_t POUT06;
    __IO uint32_t POUT07;
    __IO uint32_t POUT08;
    __IO uint32_t POUT09;
    __IO uint32_t POUT10;
    __IO uint32_t POUT11;
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    __IO uint32_t POUT14;
    __IO uint32_t POUT15;
} stc_gpio_podrb_bit_t;

typedef struct
{
    __IO uint32_t POUTE00;
    __IO uint32_t POUTE01;
    __IO uint32_t POUTE02;
    __IO uint32_t POUTE03;
    __IO uint32_t POUTE04;
    __IO uint32_t POUTE05;
    __IO uint32_t POUTE06;
    __IO uint32_t POUTE07;
    __IO uint32_t POUTE08;
    __IO uint32_t POUTE09;
    __IO uint32_t POUTE10;
    __IO uint32_t POUTE11;
    __IO uint32_t POUTE12;
    __IO uint32_t POUTE13;
    __IO uint32_t POUTE14;
    __IO uint32_t POUTE15;
} stc_gpio_poerb_bit_t;

typedef struct
{
    __IO uint32_t POS00;
    __IO uint32_t POS01;
    __IO uint32_t POS02;
    __IO uint32_t POS03;
    __IO uint32_t POS04;
    __IO uint32_t POS05;
    __IO uint32_t POS06;
    __IO uint32_t POS07;
    __IO uint32_t POS08;
    __IO uint32_t POS09;
    __IO uint32_t POS10;
    __IO uint32_t POS11;
    __IO uint32_t POS12;
    __IO uint32_t POS13;
    __IO uint32_t POS14;
    __IO uint32_t POS15;
} stc_gpio_posrb_bit_t;

typedef struct
{
    __IO uint32_t POR00;
    __IO uint32_t POR01;
    __IO uint32_t POR02;
    __IO uint32_t POR03;
    __IO uint32_t POR04;
    __IO uint32_t POR05;
    __IO uint32_t POR06;
    __IO uint32_t POR07;
    __IO uint32_t POR08;
    __IO uint32_t POR09;
    __IO uint32_t POR10;
    __IO uint32_t POR11;
    __IO uint32_t POR12;
    __IO uint32_t POR13;
    __IO uint32_t POR14;
    __IO uint32_t POR15;
} stc_gpio_porrb_bit_t;

typedef struct
{
    __IO uint32_t POT00;
    __IO uint32_t POT01;
    __IO uint32_t POT02;
    __IO uint32_t POT03;
    __IO uint32_t POT04;
    __IO uint32_t POT05;
    __IO uint32_t POT06;
    __IO uint32_t POT07;
    __IO uint32_t POT08;
    __IO uint32_t POT09;
    __IO uint32_t POT10;
    __IO uint32_t POT11;
    __IO uint32_t POT12;
    __IO uint32_t POT13;
    __IO uint32_t POT14;
    __IO uint32_t POT15;
} stc_gpio_potrb_bit_t;

typedef struct
{
    __IO uint32_t PIN00;
    __IO uint32_t PIN01;
    __IO uint32_t PIN02;
    __IO uint32_t PIN03;
    __IO uint32_t PIN04;
    __IO uint32_t PIN05;
    __IO uint32_t PIN06;
    __IO uint32_t PIN07;
    __IO uint32_t PIN08;
    __IO uint32_t PIN09;
    __IO uint32_t PIN10;
    __IO uint32_t PIN11;
    __IO uint32_t PIN12;
    __IO uint32_t PIN13;
    __IO uint32_t PIN14;
    __IO uint32_t PIN15;
} stc_gpio_pidrc_bit_t;

typedef struct
{
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    __IO uint32_t POUT02;
    __IO uint32_t POUT03;
    __IO uint32_t POUT04;
    __IO uint32_t POUT05;
    __IO uint32_t POUT06;
    __IO uint32_t POUT07;
    __IO uint32_t POUT08;
    __IO uint32_t POUT09;
    __IO uint32_t POUT10;
    __IO uint32_t POUT11;
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    __IO uint32_t POUT14;
    __IO uint32_t POUT15;
} stc_gpio_podrc_bit_t;

typedef struct
{
    __IO uint32_t POUTE00;
    __IO uint32_t POUTE01;
    __IO uint32_t POUTE02;
    __IO uint32_t POUTE03;
    __IO uint32_t POUTE04;
    __IO uint32_t POUTE05;
    __IO uint32_t POUTE06;
    __IO uint32_t POUTE07;
    __IO uint32_t POUTE08;
    __IO uint32_t POUTE09;
    __IO uint32_t POUTE10;
    __IO uint32_t POUTE11;
    __IO uint32_t POUTE12;
    __IO uint32_t POUTE13;
    __IO uint32_t POUTE14;
    __IO uint32_t POUTE15;
} stc_gpio_poerc_bit_t;

typedef struct
{
    __IO uint32_t POS00;
    __IO uint32_t POS01;
    __IO uint32_t POS02;
    __IO uint32_t POS03;
    __IO uint32_t POS04;
    __IO uint32_t POS05;
    __IO uint32_t POS06;
    __IO uint32_t POS07;
    __IO uint32_t POS08;
    __IO uint32_t POS09;
    __IO uint32_t POS10;
    __IO uint32_t POS11;
    __IO uint32_t POS12;
    __IO uint32_t POS13;
    __IO uint32_t POS14;
    __IO uint32_t POS15;
} stc_gpio_posrc_bit_t;

typedef struct
{
    __IO uint32_t POR00;
    __IO uint32_t POR01;
    __IO uint32_t POR02;
    __IO uint32_t POR03;
    __IO uint32_t POR04;
    __IO uint32_t POR05;
    __IO uint32_t POR06;
    __IO uint32_t POR07;
    __IO uint32_t POR08;
    __IO uint32_t POR09;
    __IO uint32_t POR10;
    __IO uint32_t POR11;
    __IO uint32_t POR12;
    __IO uint32_t POR13;
    __IO uint32_t POR14;
    __IO uint32_t POR15;
} stc_gpio_porrc_bit_t;

typedef struct
{
    __IO uint32_t POT00;
    __IO uint32_t POT01;
    __IO uint32_t POT02;
    __IO uint32_t POT03;
    __IO uint32_t POT04;
    __IO uint32_t POT05;
    __IO uint32_t POT06;
    __IO uint32_t POT07;
    __IO uint32_t POT08;
    __IO uint32_t POT09;
    __IO uint32_t POT10;
    __IO uint32_t POT11;
    __IO uint32_t POT12;
    __IO uint32_t POT13;
    __IO uint32_t POT14;
    __IO uint32_t POT15;
} stc_gpio_potrc_bit_t;

typedef struct
{
    __IO uint32_t PIN00;
    __IO uint32_t PIN01;
    __IO uint32_t PIN02;
    __IO uint32_t PIN03;
    __IO uint32_t PIN04;
    __IO uint32_t PIN05;
    __IO uint32_t PIN06;
    __IO uint32_t PIN07;
    __IO uint32_t PIN08;
    __IO uint32_t PIN09;
    __IO uint32_t PIN10;
    __IO uint32_t PIN11;
    __IO uint32_t PIN12;
    __IO uint32_t PIN13;
    __IO uint32_t PIN14;
    __IO uint32_t PIN15;
} stc_gpio_pidrd_bit_t;

typedef struct
{
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    __IO uint32_t POUT02;
    __IO uint32_t POUT03;
    __IO uint32_t POUT04;
    __IO uint32_t POUT05;
    __IO uint32_t POUT06;
    __IO uint32_t POUT07;
    __IO uint32_t POUT08;
    __IO uint32_t POUT09;
    __IO uint32_t POUT10;
    __IO uint32_t POUT11;
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    __IO uint32_t POUT14;
    __IO uint32_t POUT15;
} stc_gpio_podrd_bit_t;

typedef struct
{
    __IO uint32_t POUTE00;
    __IO uint32_t POUTE01;
    __IO uint32_t POUTE02;
    __IO uint32_t POUTE03;
    __IO uint32_t POUTE04;
    __IO uint32_t POUTE05;
    __IO uint32_t POUTE06;
    __IO uint32_t POUTE07;
    __IO uint32_t POUTE08;
    __IO uint32_t POUTE09;
    __IO uint32_t POUTE10;
    __IO uint32_t POUTE11;
    __IO uint32_t POUTE12;
    __IO uint32_t POUTE13;
    __IO uint32_t POUTE14;
    __IO uint32_t POUTE15;
} stc_gpio_poerd_bit_t;

typedef struct
{
    __IO uint32_t POS00;
    __IO uint32_t POS01;
    __IO uint32_t POS02;
    __IO uint32_t POS03;
    __IO uint32_t POS04;
    __IO uint32_t POS05;
    __IO uint32_t POS06;
    __IO uint32_t POS07;
    __IO uint32_t POS08;
    __IO uint32_t POS09;
    __IO uint32_t POS10;
    __IO uint32_t POS11;
    __IO uint32_t POS12;
    __IO uint32_t POS13;
    __IO uint32_t POS14;
    __IO uint32_t POS15;
} stc_gpio_posrd_bit_t;

typedef struct
{
    __IO uint32_t POR00;
    __IO uint32_t POR01;
    __IO uint32_t POR02;
    __IO uint32_t POR03;
    __IO uint32_t POR04;
    __IO uint32_t POR05;
    __IO uint32_t POR06;
    __IO uint32_t POR07;
    __IO uint32_t POR08;
    __IO uint32_t POR09;
    __IO uint32_t POR10;
    __IO uint32_t POR11;
    __IO uint32_t POR12;
    __IO uint32_t POR13;
    __IO uint32_t POR14;
    __IO uint32_t POR15;
} stc_gpio_porrd_bit_t;

typedef struct
{
    __IO uint32_t POT00;
    __IO uint32_t POT01;
    __IO uint32_t POT02;
    __IO uint32_t POT03;
    __IO uint32_t POT04;
    __IO uint32_t POT05;
    __IO uint32_t POT06;
    __IO uint32_t POT07;
    __IO uint32_t POT08;
    __IO uint32_t POT09;
    __IO uint32_t POT10;
    __IO uint32_t POT11;
    __IO uint32_t POT12;
    __IO uint32_t POT13;
    __IO uint32_t POT14;
    __IO uint32_t POT15;
} stc_gpio_potrd_bit_t;

typedef struct
{
    __IO uint32_t PIN00;
    __IO uint32_t PIN01;
    __IO uint32_t PIN02;
    __IO uint32_t PIN03;
    __IO uint32_t PIN04;
    __IO uint32_t PIN05;
    __IO uint32_t PIN06;
    __IO uint32_t PIN07;
    __IO uint32_t PIN08;
    __IO uint32_t PIN09;
    __IO uint32_t PIN10;
    __IO uint32_t PIN11;
    __IO uint32_t PIN12;
    __IO uint32_t PIN13;
    __IO uint32_t PIN14;
    __IO uint32_t PIN15;
} stc_gpio_pidre_bit_t;

typedef struct
{
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    __IO uint32_t POUT02;
    __IO uint32_t POUT03;
    __IO uint32_t POUT04;
    __IO uint32_t POUT05;
    __IO uint32_t POUT06;
    __IO uint32_t POUT07;
    __IO uint32_t POUT08;
    __IO uint32_t POUT09;
    __IO uint32_t POUT10;
    __IO uint32_t POUT11;
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    __IO uint32_t POUT14;
    __IO uint32_t POUT15;
} stc_gpio_podre_bit_t;

typedef struct
{
    __IO uint32_t POUTE00;
    __IO uint32_t POUTE01;
    __IO uint32_t POUTE02;
    __IO uint32_t POUTE03;
    __IO uint32_t POUTE04;
    __IO uint32_t POUTE05;
    __IO uint32_t POUTE06;
    __IO uint32_t POUTE07;
    __IO uint32_t POUTE08;
    __IO uint32_t POUTE09;
    __IO uint32_t POUTE10;
    __IO uint32_t POUTE11;
    __IO uint32_t POUTE12;
    __IO uint32_t POUTE13;
    __IO uint32_t POUTE14;
    __IO uint32_t POUTE15;
} stc_gpio_poere_bit_t;

typedef struct
{
    __IO uint32_t POS00;
    __IO uint32_t POS01;
    __IO uint32_t POS02;
    __IO uint32_t POS03;
    __IO uint32_t POS04;
    __IO uint32_t POS05;
    __IO uint32_t POS06;
    __IO uint32_t POS07;
    __IO uint32_t POS08;
    __IO uint32_t POS09;
    __IO uint32_t POS10;
    __IO uint32_t POS11;
    __IO uint32_t POS12;
    __IO uint32_t POS13;
    __IO uint32_t POS14;
    __IO uint32_t POS15;
} stc_gpio_posre_bit_t;

typedef struct
{
    __IO uint32_t POR00;
    __IO uint32_t POR01;
    __IO uint32_t POR02;
    __IO uint32_t POR03;
    __IO uint32_t POR04;
    __IO uint32_t POR05;
    __IO uint32_t POR06;
    __IO uint32_t POR07;
    __IO uint32_t POR08;
    __IO uint32_t POR09;
    __IO uint32_t POR10;
    __IO uint32_t POR11;
    __IO uint32_t POR12;
    __IO uint32_t POR13;
    __IO uint32_t POR14;
    __IO uint32_t POR15;
} stc_gpio_porre_bit_t;

typedef struct
{
    __IO uint32_t POT00;
    __IO uint32_t POT01;
    __IO uint32_t POT02;
    __IO uint32_t POT03;
    __IO uint32_t POT04;
    __IO uint32_t POT05;
    __IO uint32_t POT06;
    __IO uint32_t POT07;
    __IO uint32_t POT08;
    __IO uint32_t POT09;
    __IO uint32_t POT10;
    __IO uint32_t POT11;
    __IO uint32_t POT12;
    __IO uint32_t POT13;
    __IO uint32_t POT14;
    __IO uint32_t POT15;
} stc_gpio_potre_bit_t;

typedef struct
{
    __IO uint32_t PIN00;
    __IO uint32_t PIN01;
    __IO uint32_t PIN02;
    __IO uint32_t PIN03;
    __IO uint32_t PIN04;
    __IO uint32_t PIN05;
    __IO uint32_t PIN06;
    __IO uint32_t PIN07;
    __IO uint32_t PIN08;
    __IO uint32_t PIN09;
    __IO uint32_t PIN10;
    __IO uint32_t PIN11;
    __IO uint32_t PIN12;
    __IO uint32_t PIN13;
    __IO uint32_t PIN14;
    __IO uint32_t PIN15;
} stc_gpio_pidrf_bit_t;

typedef struct
{
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    __IO uint32_t POUT02;
    __IO uint32_t POUT03;
    __IO uint32_t POUT04;
    __IO uint32_t POUT05;
    __IO uint32_t POUT06;
    __IO uint32_t POUT07;
    __IO uint32_t POUT08;
    __IO uint32_t POUT09;
    __IO uint32_t POUT10;
    __IO uint32_t POUT11;
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    __IO uint32_t POUT14;
    __IO uint32_t POUT15;
} stc_gpio_podrf_bit_t;

typedef struct
{
    __IO uint32_t POUTE00;
    __IO uint32_t POUTE01;
    __IO uint32_t POUTE02;
    __IO uint32_t POUTE03;
    __IO uint32_t POUTE04;
    __IO uint32_t POUTE05;
    __IO uint32_t POUTE06;
    __IO uint32_t POUTE07;
    __IO uint32_t POUTE08;
    __IO uint32_t POUTE09;
    __IO uint32_t POUTE10;
    __IO uint32_t POUTE11;
    __IO uint32_t POUTE12;
    __IO uint32_t POUTE13;
    __IO uint32_t POUTE14;
    __IO uint32_t POUTE15;
} stc_gpio_poerf_bit_t;

typedef struct
{
    __IO uint32_t POS00;
    __IO uint32_t POS01;
    __IO uint32_t POS02;
    __IO uint32_t POS03;
    __IO uint32_t POS04;
    __IO uint32_t POS05;
    __IO uint32_t POS06;
    __IO uint32_t POS07;
    __IO uint32_t POS08;
    __IO uint32_t POS09;
    __IO uint32_t POS10;
    __IO uint32_t POS11;
    __IO uint32_t POS12;
    __IO uint32_t POS13;
    __IO uint32_t POS14;
    __IO uint32_t POS15;
} stc_gpio_posrf_bit_t;

typedef struct
{
    __IO uint32_t POR00;
    __IO uint32_t POR01;
    __IO uint32_t POR02;
    __IO uint32_t POR03;
    __IO uint32_t POR04;
    __IO uint32_t POR05;
    __IO uint32_t POR06;
    __IO uint32_t POR07;
    __IO uint32_t POR08;
    __IO uint32_t POR09;
    __IO uint32_t POR10;
    __IO uint32_t POR11;
    __IO uint32_t POR12;
    __IO uint32_t POR13;
    __IO uint32_t POR14;
    __IO uint32_t POR15;
} stc_gpio_porrf_bit_t;

typedef struct
{
    __IO uint32_t POT00;
    __IO uint32_t POT01;
    __IO uint32_t POT02;
    __IO uint32_t POT03;
    __IO uint32_t POT04;
    __IO uint32_t POT05;
    __IO uint32_t POT06;
    __IO uint32_t POT07;
    __IO uint32_t POT08;
    __IO uint32_t POT09;
    __IO uint32_t POT10;
    __IO uint32_t POT11;
    __IO uint32_t POT12;
    __IO uint32_t POT13;
    __IO uint32_t POT14;
    __IO uint32_t POT15;
} stc_gpio_potrf_bit_t;

typedef struct
{
    __IO uint32_t PIN00;
    __IO uint32_t PIN01;
    __IO uint32_t PIN02;
    __IO uint32_t PIN03;
    __IO uint32_t PIN04;
    __IO uint32_t PIN05;
    __IO uint32_t PIN06;
    __IO uint32_t PIN07;
    __IO uint32_t PIN08;
    __IO uint32_t PIN09;
    __IO uint32_t PIN10;
    __IO uint32_t PIN11;
    __IO uint32_t PIN12;
    __IO uint32_t PIN13;
    __IO uint32_t PIN14;
    __IO uint32_t PIN15;
} stc_gpio_pidrg_bit_t;

typedef struct
{
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    __IO uint32_t POUT02;
    __IO uint32_t POUT03;
    __IO uint32_t POUT04;
    __IO uint32_t POUT05;
    __IO uint32_t POUT06;
    __IO uint32_t POUT07;
    __IO uint32_t POUT08;
    __IO uint32_t POUT09;
    __IO uint32_t POUT10;
    __IO uint32_t POUT11;
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    __IO uint32_t POUT14;
    __IO uint32_t POUT15;
} stc_gpio_podrg_bit_t;

typedef struct
{
    __IO uint32_t POUTE00;
    __IO uint32_t POUTE01;
    __IO uint32_t POUTE02;
    __IO uint32_t POUTE03;
    __IO uint32_t POUTE04;
    __IO uint32_t POUTE05;
    __IO uint32_t POUTE06;
    __IO uint32_t POUTE07;
    __IO uint32_t POUTE08;
    __IO uint32_t POUTE09;
    __IO uint32_t POUTE10;
    __IO uint32_t POUTE11;
    __IO uint32_t POUTE12;
    __IO uint32_t POUTE13;
    __IO uint32_t POUTE14;
    __IO uint32_t POUTE15;
} stc_gpio_poerg_bit_t;

